const data = {
  "1": {
    "112": {
      "explainQuestion": {
        "1": "UML的中文全称是：",
        "2": "java对象最突出的特点是："
      },
      "selectQuestion": {
        "1": "电子计算机的发展已经经历了4代，这4代计算机的主要元件分别是(    )。\n    A．电子管、晶体管、中小规模集成电路、激光器件\n    B．晶体管、中小规模集成电路、激光器件、光介质\n    C．电子管、晶体管、中小规模集成电路、大规模集成电路\n    D．电子管、数码管、中小规模集成电路、激光器件",
        "2": "微型计算机的发展以(    )技术为标志。\n    A．操作系统    B．微处理器    C．磁盘    D．软件",
        "3": "可以在计算机中直接执行的语言和用助记符编写的语言分别是(    )。\n    Ⅰ．汇编语言    Ⅱ．机器语言    Ⅲ，高级语言\n    Ⅳ．操作系统原语    Ⅴ．正则浯言\n    A．Ⅰ、Ⅲ    B．Ⅰ、Ⅳ    C．Ⅰ、Ⅱ    D．Ⅱ、Ⅴ",
        "4": "只有当程序执行时才将源程序翻译成机器语言，并且一次只能翻译一行语句，边翻译边执行的是(    )程序，把汇编语言源程序转变为机器语言程序的过程是(    )。\n    Ⅰ．编译  Ⅱ．目标    Ⅲ．汇编    Ⅳ．解释\n    A．Ⅰ、Ⅱ    B．Ⅳ、Ⅱ    C． Ⅳ、Ⅰ   D．Ⅳ、Ⅲ",
        "5": "到目前为止，计算机中所有的信息仍以二进制方式表示的理由是(    )。\n    A．节约元件  B．运算速度快  C．由物理器件的性能决定    D．信息处理方便"
      },
      "answerQuestion": {
        "1": "简述什么是模型以及模型的表现形式？"
      },
      "calculateQuestion": {
        "1": "计算1+1"
      },
      "synthesizeQuestion": {
        "1": "这是一道综合题"
      }
    },
    "122": {
      "explainQuestion": "explainQuestion1-2-2",
      "selectQuestion": {
        "1": "完整的计算机系统应包括(    )。\n    A．运算器、存储器、控制器\n    B．外部设备和主机\n    C．主机和应用程序\n    D．配套的硬件设备和软件系统",
        "2": "冯·诺依曼机的基本工作方式是(    )。\n    A．控制流驱动方式    B．多指令多数据流方式\n    C．微程序控制方式    D．数据流驱动方式",
        "3": "在CPU中，跟踪下一条要执行的指令的地址的寄存器是(    )\n    A．PC    B．MAR    C．MDR    D．IR",
        "4": "CPU不包括(    )。\n    A．地址寄存器    B．指令寄存器(IR)\n    C．地址译码器    D．通用寄存器",
        "5": "在运算器中，不包含(    )，\n    A．状态寄存器    B．数据总线\n    C．ALU          D．地址寄存器",
        "6": "下列(    )属于应用软件。\n    A．操作系统     B．编译程序\n    C．连接程序     D．文本处理",
        "7": "一个8位的计算机系统以16位来表示地址，则该计算机系统有(    )个地址空间。\n    A． 256    B．65535    C． 65536    D． 131072",
        "8": "计算机系统的层次结构可以分为6层，其层次之间的依存关系是(    )。\n    A．上下层之间相互无关\n    B．上层实现对下层的功能扩展，而下层是实现上层的基础\n    C．上层实现对下层的扩展作用，而下层对上层有限制作用\n    D．上层和下层的关系是相互依存、不可分割的",
        "9": "【2009年计算机联考真题】冯·诺依曼计算机中指令和数据均以二进制形式存放在存储器中．CPU区分它们的依据是(    )。\n    A．指令操作码的译码结果    B．指令和数据的寻址方式\n    C．指令周期的不同阶段      D．指令和数据所在的存储单元",
        "10": "下列为CPU存取速度的比较，正确的是(    )。\n    A．Cache>内存>寄存器    B． Cache>寄存器>内存\n    C．寄存器>Cache>内存    D．寄存器>内存>Cache",
        "11": "关于编译程序和解释程序，下面说法错误的是(    )。\n    A．编译程序和解释程序的作用都是将高级语言程序转换成机器语言程序\n    B．编译程序编译时问较长，运行速度较快\n    C．解释程序方法较简单，运行速度也较快\n    D．解释程序将源程序翻译成机器语言，并且翻译一条以后，立即执行这条语句",
        "12": "下列叙述中正确的是(    )。\n    A．寄存器的设置对汇编语言是透明的\n    B．实际应用程序的测试结果能够全面代表计算机的性能\n    C．系列机的基本特性是指令系统向后兼容\n    D．软件和硬件在逻辑功能上是等价的",
        "13": "下列(    )是冯·诺依曼机工作方式的基本特点。\n    A．多指令流单数据流    B．按地址访问并顺序执行指令\n    C．堆栈操作            D．存储器按内容选择地址",
        "14": "存放欲执行指令的寄存器是(    )。\n    A．MAR    B．PC\n    C．MDR    D．IR",
        "15": "指令流通常是(    )。\n    A．从主存流向控制器      B．从控制器流向主存\n    C．从控制器流向控制器    D．从主存流向主存",
        "16": "以下说法错误的是(    )。\n    A．硬盘是外部设备\n    B．软件的功能与硬件的功能在逻辑上是等效的\n    C．硬件实现的功能一般比软件实现具有更高的执行速度\n    D．软件的功能不能用硬件取代",
        "17": "在CPU的组成中，不包括(    )。\n    A．运算器  B．存储器  C．控制器  D．寄存器",
        "18": "下列(    )不属于系统程序。\n    A．数据库系统    B．操作系统\n    C．编译程序    D．以上3种都属于系统程序",
        "19": "关于相连存储器，下列说法正确的是(    )。\n    A．只可以按地址寻址\n    B．只可以按内容寻址\n    C．既可以按地址寻址又可以按内容寻址\n    D．以上说法均不完善",
        "20": "(    )是程序运行时的存储位置，包括所需的数据。\n    A．数据通路    B．主存    C．硬盘    D．操作系统"
      },
      "answerQuestion": "answerQuestion1-3-2",
      "calculateQuestion": "calculateQuestion1-3-2",
      "synthesizeQuestion": "synthesizeQuestion1-3-2"
    },
    "132": {
      "explainQuestion": "explainQuestion1-3-2",
      "selectQuestion": {
        "1": "【2010年计算机联考真题】下列选项中，能缩短程序执行时间的措施是(    )。\n    Ⅰ．提高CPU时钟频率  Ⅱ．优化数据通路结构    Ⅲ．对程序进行编译优化\n    A．仅Ⅰ和U    B．仅Ⅰ和Ⅲ    C．仅Ⅱ和Ⅲ  D．Ⅰ、Ⅱ、Ⅲ",
        "2": "【2011年计算机联考真题】下列选项中，描述浮点数操作速度指标的是(    )。\n    A．MIPS    B．CPI    C．IPC    D．MFLOPS",
        "3": "关于CPU主频、CPI、MIPS、MFLOPS，说法正确的是(    )。\n    A．CPU主频是指CPU系统执行指令的频率．CPI是执行一条指令平均使用的频率\n    B．CPI是执行一条指令平均使用CPU时钟的个数．MIPS描述一条CPU指令平均使用CPU时钟数\n    C．MIPS是描述CPU执行指令的频率．MFLOPS是计算机系统的浮点数指令\n    D．CPU主频指CPU使用的时钟脉冲频率，CPI是执行一条指令平均使用CPU时钟数",
        "4": "存储字长是指(    )。\n    A．存放在一个存储单元中的二进制代码组合\n    B．存放在一个存储单元中的二进制代码位数\n    C．存储单元的个数\n    D．机器指令的位数",
        "5": "以下说法错误的是(    )。\n    A．计算机的机器字长是指数据存储与运算的基本单位\n    B．寄存器由触发器构成\n    C．计算机中一个字的长度都是32位\n    D．磁盘可以永久性存放数据和程序",
        "6": "下列关于机器字长的说法正确的是(    )。\n    Ⅰ．三者在数值上总是相等的   Ⅱ．三者在数值上可能不等\n    Ⅲ．存储字长是存放在一个存储单元中的二进制代码位数\n    Ⅳ，数据字长就是MDR的位数\n    A．Ⅰ、Ⅲ    B．Ⅰ、Ⅳ    C．Ⅱ、Ⅲ    D．Ⅱ、Ⅳ",
        "7": "下列关于“兼容”的叙述，正确的是(    )。\n    A．指计算机软件与硬件之间的通用性，通常在同一系列不同型号的计算机间存在\n    B．指计算机软件或硬件的通用性，即它们在任何计算机间可以通用\n    C．指计算机软件或硬件的通用性，通常在同一系列不同型号的计算机间通用\n    D．指软件在不同系列计算机中可以通用，而硬件不能通用",
        "8": "32位微机是指该计算机所用CPU(    )。\n    A．具有32位寄存器    B．能同时处理32位的二进制数\n    C．具有32个寄存器    D．能处理32个字符",
        "9": "用于科学计算的计算机中，标志系统性能的主要参数是(    )。\n    A．主时钟频率    B．主存容量\n    C．MFLOPS      D． MIPS",
        "10": "当前设计高性能计算机的重要技术途径是(    )。\n    A．提高CPU主频          B．扩大主存容量\n    C．采用非冯·诺依曼    D．采用并行处理技术",
        "11": "若一台计算机的机器字长为4B，则表明该机器(    )，\n    A．能处理的数值最大为4位十进制数\n    B．能处理的数值最多为4位二进制数\n    C．在CPU中能够作为一个整体处理32位的二进制代码\n    D．在CPU中运算的结果最大为232",
        "12": "在CPU的寄存器中，(    )对用户是完全透明的。\n    A．程序计数器    B．指令寄存器\n    C．状态寄存器    D．通用寄存器",
        "13": "从用户观点看，评价计算机系统性能的综合参数是(    )。\n    A．指令系统    B．吞吐率\n    C．主存容量    D．主频率",
        "14": "计算机操作的最小单位时间是(    )。\n    A．时钟周期    B．指令周期\n    C．CPU周期    D．中断周期\n    15．CPU的CPI与下列哪个因素无关？(    )\n    A．时钟频率    B．系统结构\n    C．指令集      D．计算机组织",
        "15": "下列说法正确的是(    )。\n    Ⅰ．在微型计算机的广泛应用中，会计电算化属于科学计算方面的应用。\n    Ⅱ．决定计算机计算精度的主要技术是计算机的字长。\n    Ⅲ．计算机“运算速度”指标的含义是每秒钟能执行多少条操作系统的命令。\n    Ⅳ．利用大规模集成电路技术把计算机的运算部件和控制部件做在一块集成电路芯片上．这样的一块芯片叫单片机。\n    A．Ⅰ、Ⅲ    B．Ⅱ、Ⅳ    C．Ⅱ    D．Ⅰ、Ⅲ、Ⅳ"
      },
      "answerQuestion": "answerQuestion1-3-2",
      "calculateQuestion": "calculateQuestion1-3-2",
      "synthesizeQuestion": "synthesizeQuestion1-3-2"
    }
  },
  "2": {
    "212": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "下列不同进位计数制的数中，最大的数是(    )。\n    A．(0.10l)2   B．(0.62)10\n    C．(0.52)8    D．(0.75)16",
        "2": "下列各种数制的数中，最小的数是(    )。\n    A. (1O1OO1)B    B. (1OlOOl)BCD\n    C．(52)0    D．(233)H",
        "3": "两个数7E5H和4D3H相加，得(    )。\n    A．BD8H    B．CD8H\n    C．CB8H    D. CC8H",
        "4": "若十进制数为l37.5，则其八进制数为(    )。\n    A．89.8    B．211.4\n    C．211.5    D．IO11111.101",
        "5": "四位机器内的数值代码，则它所表示的十迸制真值可能为(    )。\n    Ⅰ．16  Ⅱ.-1    Ⅲ．-8    Ⅳ．8\n    A．Ⅰ、Ⅱ、Ⅲ    B．Ⅱ、Ⅳ\n    C．Ⅱ、Ⅲ、 Ⅳ   D．只有 Ⅳ",
        "6": "一个16位无符号二进制数的表示范围是(    )。\n    A. 0—5536    B. 0～66535    C．-32768—32767    D．-32768～32768",
        "7": "下列说法育误差的是(    )。\n    A．任何二进制整数都可以用十避制表示\n    B．任何二进制小数都可以用十进制表示\n    C．任何十进制整数都可以用二迸制表示\n    D．任何十进制小数都可以用二进制表示",
        "8": "下列关于ASCII编码，正确的描述是(    )。\n    A．使用8位二进制代码，最右边一位为l\n    B．使用8位二进制代码，最左边一位为O\n    C．使用8位二进制代码，最右边一位是0\n    D．使用8位二进制代码，最左边一位是l",
        "9": "“春”字的机内码为B4BAH，由此可以推算它在GB 2312-1980中所在的区号是 (    )。\n    A．19区    B．20区    C．3区    D．35区",
        "10": "在一个按字节编址的计算机中，若数据在存储器中以小端方案存放。假定int行变量j盼地址为08000000H，i的机器数为01234567H，地址08000；000H单元的内容是(    )。\n    A．O1H    B．23H\n    C．45H    D．67H",
        "11": "以下关于校验码的叙述中，正确的是(    )。\n    Ⅰ．校验码的码距必须大于2\n    Ⅱ.校验码的码距越大，检、纠错能力越强\n    Ⅲ．增加奇偶校验位的位数，可以提高奇偶校验的正确性\n    Ⅳ．采用奇偶校验可检测出一位数据错误的位置并加以纠正\n    Ⅴ．采用海明校验可检测出一位数据错误的位置并加以纠正\n    Ⅵ．CRC码是通过除法运算来建立数据祁校验位之间的约定关系的\n    A. Ⅰ、Ⅲ、Ⅴ    B．Ⅱ、Ⅳ、Ⅵ\n    C．Ⅰ、Ⅴ、Ⅵ    D．Ⅱ、Ⅴ、Ⅵ",
        "12": "设在网络中传送采用偶校验的ASCII码，当收到的数据位为10101001时，可以断定(    )。\n    A．未出错    B．出现偶数位错\n    C．未出错或出现偶数位错    D．出现奇数位错",
        "13": "下列校验码中，奇校验正确的有(    )。\n    A. 110100111    B．001000111\n    C. 010110011    D.110100111",
        "14": "用l位奇偶校验能检测出1位主存错误的百分比为(    )。\n    A．O%    B．100%\n    C. 50%    D．无法计算",
        "15": "已知大写英文字母“A”的ASCII码值为41H，现字母“F”被存放在某个存储单元中，若采用偶校验（假设最高位作为校验位）．则该存储单元中存放的十六进制数是(    )。\n    A. 46H    B．C6H\n    C．47H    D．C7H",
        "16": "用海明码来发觋并纠正1位错，信息位为8位，则检验位的位数为(    )。\n    A．1    B．3    C．4    D．8",
        "17": "能发现两位错误井能纠正I位错的编码是(    )。\n    A．CRC码    B．海明码\n    C．偶校验码    D．奇校验码",
        "18": "在CRC中，接收端检测出某一位数据错误后，纠正的方法是(    )。\n    A．请求重发  B．删除数据    C．通过余数值自行纠正    D．以上均可",
        "19": "在大量数据传送过程中，常用且有效的检验法是(    )。\n    A．海明码校验    B．偶校验\n    C．奇校验    D．CRC",
        "20": "设待校验的数据为D8～DI=10101011，若采用海明校验，其海明码为(    )(设海明码具有一位纠错能力，P13采用全校验)；若采用CRC．且生成多项式为10011，则：CRC码为(    )。\n    A. 0 1010 0 101 1 1 11    B.0 1000 0 111 1 1 11\n    C. 10101011 1010    D．10101010 1011"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "222": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "【2009年计算机联考真题】\n一个C语言程序在一台32位机器上运行。程序中定义了三个变量x、y、z，其中x和z为int型．y为short型。当x=127、y=-9时，执行赋值语句萨x+y后，x、y、z的值分别是  (    )。\n    A．X=0000007FH.y=FFF9H.z=0000076H\n    B．X=0000007FH, y=FFF9H.z=FFFF0076H\n    C．X=0000007FH,y=FFF7H,z=fFFF0076H\n    D．X一0000007FH, y=FFF7H, z~0000076H",
        "2": "【2010年计算机联考真题】\n假定有4个整数用8位补码分别表示r1=FEH，r2=F2H、r3=90H、r4=F8H．若将运算结果存放在一个8位寄存器中，则下列运算会发生溢出的是(    )。\n    A．rl * r2    B．r2 *r3\n    C．rl *r4    D．r2 *r4",
        "3": "对真值0表示形式唯一的机器数是(    )。\n    A．原码    B．补码和移码    C．反码    D．以上都不对",
        "4": "5．若【X】补=l.1101010，则[X]原=(    ).\n    A．1.0010101    B.1.0010110    C．0.0010110    D.0.1101010",
        "5": "若【X】补=l.1101010，则[X]原=(    ).\n    A- 1.0010101    B.1.0010110    C．0.0010110    D.0.1101010",
        "6": "如果X为负数，由【X】补¨求【-X】补是将(    )，\n    A．【X】补¨各值保持不变\n    B．【X】补符号位变反，其他各位不变\n    C．【X】补¨除符号位外，各位变反，末位加l\n    D．【X】补连同符号位一起变反，末位加l",
        "7": "原码能表示的不同数据有(    )。\n    A．15    B．16\n    C．255    D．256",
        "8": "定点小数反码【X]a=xo.x1 。。。xn表示的数值范围是(    )。\nA．-1+2-n<x≤1-2-n   B．-1+2-n≤x<1-2-n   '\nC．-1+2-n≤x≤1-2-n    D．-1+2-n<x<1-2-n ",
        "9": "一个n+l位整数x原码的数值范围是(    )。\nA．-2n+l<x<2n -l  B．-2n+l≤x<2n -l C．-2n+l<x≤2n -l   D．-2n+l≤x≤2n -l",
        "10": "补码定点整数01010101左移两位后的值为(    )。\n    A． 0100 0111    B．0101 0100    C． 0100 0110    D． 0101 0101",
        "11": "补码定点整数1001 0101右移l位后的值为(    )。\n    A．0100 1010    B．0100l010 l    C．1000 1010    D．1100 1010",
        "12": "计算机内部的定点数大多用补码表示，以下是一些关手补码特点的叙述：\n    Ⅰ．零的表示是唯一的\n    Ⅱ．符号位可以和数值部分一起参加运算\n    Ⅲ．和其真值的对应关系简单、直观\n    Ⅳ，减法可用加法来实现\n在以上叙述中，(    )是补码表示的特点。\n    A．Ⅰ和Ⅱ    B．Ⅰ和Ⅲ    C．Ⅰ和Ⅱ和Ⅲ   D．Ⅰ和Ⅱ和Ⅳ",
        "13": "n位定点整数表示的最大值是(    )。\n    A．2n    B．2n-l    C．2n-1   D．2n-1 -l ",
        "14": "对于相同位数（设为N位，符号位均为l位）的二进制补码小数和十进制小数，二进制小数能表示的数的个数／十进制小数所能表示数的个数为(    )\n    A．(0.2)N    B．(0.2)N-1    C．(0.02)N    D．(0.02)N-1",
        "15": "若定点整数64位，含一位符号位，采用补码表示，所能表示的绝对值最大负数为(    )。\n    A．-264B．-(264-1)    C．-263D．-(263-1) ",
        "16": "5位二进制定点小数，用补码表示时，最小负数是(    )。\n    A．0.111    B．1.0001    C．1.111    D．1.0000",
        "17": "下列关于补码和移码关系的叙述中，(    )是不正确的。\n    A．相同位数的补码和移码表示具有相同的数据表示范围\n    B．零的补码和移码表示相同\n    C．同一个数的补码和移码表示，其数值部分相同，而符号相反\n    D．一般用移码表示浮点数的阶，而补码表示定点整数",
        "18": "设【X】补.=1.X1X2X3X4，当满足(    )时，x<-l/2成立。\n    A．X1必须为1．X2X3X4至少有一个为l\n    B．X1必须为l，X2X3X4任意\n    C．X1必须为0．X2X3X4至少有一个为l\n    D．X1必须为0，X2X3X4任意",
        "19": "若【x】补=1．X1X2X3X4X5X6．其中xi驭0或1．若耍x>-32，应当满足(    )。\n    A．X1为0，其他各位任意\n    B．X1为l，其他各位任意\n    C．X1为l，X2X3X4X5X6中至少有一位为l\n    D．X1为0，X2X3X4X5X6中至少有一位为l",
        "20": "设x为整数，【x】补=1．X1X2X3X4X5，若要x<-16，X1～X5应满足的条件是(    )。\n    A．X1X2X3X4X5至少有一个为l\n    B．X1必须为0，X2～X5至少有一个为l\n    C．X1必须为0，X2～X5任意\n    D．X1必须为1．X2～X5任意",
        "21": "已知定点小数X的补码为1．X1X2X3，且X≤-0．75，则必有(    )。\n    A．X1=l, X2=0,X3=1    B．X1=l\n    C．X1=0，且X2X3不全为l    D．X1=0，X2=0，X3=0",
        "22": "一个8位寄存器内的数值为11001010，标志寄存器C为0．若将此8位寄存器循环左移（不带进位位）1位，则该8位寄存嚣和标志寄存器内数值分别为(    )．\n    A．10010100  l    B．10010101  O    C．10010101    l    D．10010100    0",
        "23": "设机器数字长8位（含1位符号位），若机器数BAH为原码，算术左移l位和算术右移1位分别得(    )。\n    A．F4H EDH    B．B4H 6DH    C．F4H 9DH    D． B5H EDH",
        "24": "若机器数BAH为补码，其余条件同23题，则有(    )\n    A．F4H EDH    B．B4H 6DH    C． F4H 9DH    D． B5H EDH",
        "25": "设x为真值，x*为其绝对值，满足【-x*】补=【-x】补，当且仅当(    )。\n    A．x任意    B．x为正数    C．x为负数    D．以上说法都不对",
        "26": "16位补码Ox8FAO扩展为32位应该是(    )。\n    A．Ox0000 8FAO    B． OxFFFF 8FAO    C． OxFFFF FFAO    D．Ox8000 8FAO",
        "27": "在定点运算器中，无论采用双符号位还是单符号位，必须有(    )。\n    A．译码电路，它一般用“与非”门来实现\n    B．编码电路，它一般用“或非”门来实现\n    C．溢出判断电路．它一般用“异或”门来实现\n    D．移位电路，它一般用“与或非”门来实现",
        "28": "下列说法中正确的是(    )。\n    Ⅰ．在计算机中，所表示的数有时会发生溢出，其根本原因是计算机的字长有限\n    Ⅱ．8421码就是二进制数\n    Ⅲ．一个正数的补码和这个数的原码表示一样，而正数的反码是原码各位取反\n    Ⅳ．设有两个正的规格化浮点数：N1=2mXMi，N’-2“xM2，若m>n，则有NI>N2\n    A． Ⅰ、Ⅱ    B．Ⅱ、Ⅲ    C． Ⅰ、Ⅲ、Ⅳ    D． Ⅰ、Ⅳ",
        "29": "关于模4补码，下列说法正确的是(    )。\n    A．模4补码和模2补码不同，它更容易检查乘除运算中的溢出问题\n    B．每个模4补码存储时只需一个符号位\n    C．存储每个模4补码需要两个符号位\n    D．模4补码，在算术与逻辑部件中为一个符号位",
        "30": "假定一个叶。进制数为-66，按补码形式存放在一个8位寄存器中，该寄存器的内容用十六进制表示为(    )。\n    A．C2H    B．BEH    C．BDH    D．42H",
        "31": "设机器数采用补码表示（含1位符号位）．若寄存器内容为9BH，则对应的十进制数为(    )。\n    A．-27    B．-97    C．-101    D．155",
        "32": "若寄存嚣内容为10000000，若它等于一0，则为(    )。\n    A．原码    色．补码    C．反码    D．移码",
        "33": "若寄存器内容为11111111，着它等于+127，则为(    )。\n    A．反码    B．补码    C．原码    D．移码",
        "34": "若寄存器内容为11111111，著它等于一1．则为(    )。\n    A．原码    B．补码    C．反码    D．移码",
        "35": "若寄存器内容为00000000，若它等于-128，则为(    )。\n    A．原码    B．补码    C．反鸱    D．够码",
        "36": "若二进制定点小数真值是-0．1101．机器表示为1．0010，则该薮采用的编码方法是  (    )。\n    A．原码    B．补码    C．反码    D．移码",
        "37": "下列为8位移码机器数[x]移，当求[-x]移时，(    )将会发生溢出。\n    A．1111111    B．00000000    C．10000000    D．01111111",
        "38": "若采用双符号位，则两个正数相加产生溢出的特征时，双符号位为(    )。\n    A．00    B．01    C．10    D．11",
        "39": "判断加减法溢出时，可采用判断进使的方式，如果符号位的进位为Co,最高位的进位为C1．产生溢出的条件是(    )。\n    Ⅰ．Co产生进位    Ⅱ．C1产生进位\n    Ⅲ ．Co、C1都产生进位    Ⅳ．Co、Cl都不产生进位\n    Ⅴ．C0产生进位，Cl不产生进位  Ⅵ．C0不产生进位，C1产生进位\n    A． Ⅰ和Ⅱ    B．Ⅲ    C．Ⅳ    D．Ⅴ和Ⅵ",
        "40": "在补码的加减法中，用两位符号位判断溢出，两位符号位Ss1Ss2=10时，表示(    )。\n    A．结果为正数，无溢出    B．结果正溢出\n    C．结果负溢出    D．结果为负数，无溢出",
        "41": "若【X】补=X0，X1X2…Xn，其中Xo为符号位，X1为最高数位。若(    )则当补码左移时，将会发生溢出。\n    A．Xn一X,    B．X0≠Xi\n    C．X1;O    D．Xi=l",
        "42": "原码乘法是(    )。\n    A．先取操作数绝对值相乘，符号位单独处理\n    B．用原码表示操作数，然后壹接相乘\n    C．被乘数用原码表示，乘数去绝对值，然后相乘\n    D．乘数用原码表示，被乘数去绝对值，然后相乘",
        "43": "x、y为定点整数，其格式为l位符号位．n位数值位，若采用补码一位莱法实现乘法运算，则最多需要(    )次加法运算。\n    A．n—l    B．n    C．n+l    D．n+2",
        "44": "在原码一位乘法中．(    )。\n    A．符号位参加运算\n    B．符号位不参加运算\n    C．符号位参加运算，并根据运算结果改变结果中的符号位\n    D．符号位不参加运算，并根据运算结果确定结果中的符号",
        "45": "原码乘法时，符号位单独处理乘积的方式是(    )。\n    A．两个操作数符号相“与”    B．两个操作数符号相“或”\n    C．两个操作数符号相“异或”    D．两个操作数中绝对值较大数的符号",
        "46": "实现N位（不包括符号位）补码一位乘时，乘积为(    )位。\n    A．N    B．N+l    C．2N    D．2N+1",
        "47": "在原码不恢复余数除法（叉称原码加减交替法）的算法中．(    )。\n    A．每步操作后，若不够减，则需恢复余数\n    B．若为负商，则恢复余数\n    C．整个算法过程中，从不恢复余数\n    D．仅当最后一步不够减时，才恢复一次余数",
        "48": "下列关于补码除法说法正确的是(    )．\n    A．补码不恢复除法中，够减商0，不够减商1\n    B．补码不恢复余数除法中，异号相除时，够减商0j不够减商1\n    C．补码不恢复除法中，够减商l，不够减商0\n    D．以上都不对"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "232": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "【2009年计算机联考真怎】\n浮点数加、减运算过程一般包括对阶、尾数运算、规格化、舍入和判溢出等步骤。设浮点数的阶码和尾数均采用补码表示，且位数分别为5位和7位（均含2位符号位）。若有两个\n数X=27 *29/32，Y=25* 5/8，则用浮点加法计算X+Y的最终结果是(    )。\n    A．00111 1100010    B．00111 0100010\n    C．01000 0010001    D．发生溢出",
        "2": "【2010年计算机联考真囊】\n假定变量i、f和d的数据类型分别为int、float和double（int用补码表示．float和double分别用IEEE 754单精度和双精度浮点数格式表示），已知i=785、f=1.5678E3、d=1.5E100，若在32位机器中执行下列关系表达式，则结果为“真”的是(    )。\n    I． i=(int)(float)i    Ⅱ．f-=(float)(int)f\n    Ⅲ．f=(float)(double)f    Ⅳ．(d+f)-d=f\n    A．仅I和Ⅱ    B．仅I和Ⅲ\n    C．仅Ⅱ和Ⅲ    D．仅Ⅲ和Ⅳ",
        "3": "【2011年计算机联考真题】\nfloat型数据通常用IEEE 754单精度浮点数格式表示。若编译器将float塑变量x分配在一个32位浮点寄存器FRI中，且x- -8.25，则FRI的内客是(    )。\n    A．C104 0000H    B．C242 0000H\n    C．C184 0000H    D．C1C2 0000H",
        "4": "长度相同但格式不同的两种浮点数，假设前者阶码长、尾数短，后者阶码短、尾数长，其他规定均相同，则它们可表示的数的花围和精度为(    )。\n    A．两者可表示的数的范围和精度相同\n    B．前者可表示的数的范围大但精度低\n    C．后者可表示的数的范围大且精度高\n    D．前者可表示的数的范围大且精度高",
        "5": "长度相同、格式相同的两种浮点数，假设前者基数大，后者基数小，其他规定均相同，则它们可表示的数的范围和精度为(    )。\n    A．两者可表示的数的范围和精度相同\n    B．前者可表示的数的范围大但精度低\n    C．后者可表示的数的范围大且精度高\n    D．前者可表示的数的范围大且精度高",
        "6": "下列说法中正确的是(    )。\n    A．采用变形补码进行加减法运算可以避免溢出\n    B．只有定点数运算才可能溢出，浮点数运算不会产生溢出\n    C．定点数和浮点数运算都可能产生溢出\n    D．两个正数相加时一定产生溢出",
        "7": "在规格化浮点运算中，蔷某浮点数为25*l.10101．其中尾数为补码表示-则该数  (    )。\n    A．不需规格化    B．需右移规格化\n    C．需将尾数左移一位规格化    D．需将尾数左移两位规格化",
        "8": "浮点数格式如下：1位阶符，6位阶码，l位数符，8位尾数。若阶码用移码，尾数用补码表示，则浮点数所能表示数的范围是(    )。\n    A．-263～(1-2-8)×263    B． -264～(1-2-7)×264   \n    C．-(1-2-8)×263 ～263   D．-(1-2-7)×264～(1-2-8)×263  ",
        "9": "某浮点机，采用规格化浮点数表示，阶码用移码表示（最高位代表符号位）．尾数用原码表示。下列哪个数的表示不是规格化浮点数？(    )\n    阶码    尾数    阶码    尾数\n    A．11111111,1.1000．．．00   B．0011111,1.0111．．．01\n    C．1000001,0.1111．．．01    D．0111111,0.1000．．．10",
        "10": "设浮点数阶韵基数为8，尾数用模4补码表示。试指出下列浮点数中哪个是规格化数?(    )\n    A．11.111000    B．00.000111\n    C．11.101010    D．11.111101",
        "11": "下列关于对阶操作说法正确的是(    )。\n    A．在浮点加减运算的对阶操作中，若阶码减小，则尾数左移\n    B．在浮点加减j蚕算的对pr操作中，若阶码增大，则尾数右移；若阶码减小，则尾数左移\n    C．在浮点加减运算的对阶操作中，若阶码增大，则尾数右移\n    D．以上都不对",
        "12": "浮点数的IEEE 754标准对尾数编码采用的是(    )。\n    A．原码    B．反码\n    C．补码    D．移码",
        "13": "在IEEE 754标准规定的64位浮点数格式中，符号位为1位，阶码为11位，尾数为52位，则它所能表示的最小规格化负数为(    )。\n    A．-(2-252)×2-1023    B．-(2-2—52)×21023\n    C．-1×2-1024    D．-(1-2-52)x2+2047",
        "14": "按照TEEE 754标准规定的32位浮点数(41A4C000)16对应的十进制数是(    )。\n    A．4,59375    B．-20.59375\n    C．-4.59375    D．20.59375",
        "15": "在浮点数编码表示中，(    )在机器数中不出现，是隐含的。\n    A．阶码    B．符号\n    C．尾数    D．基数",
        "16": "如果某单精度浮点数、某原码、某补码、某移码的32位机器数均为0xF0000000。这些数从大到小的顺序是(    )。\n    A．浮原补移    B．浮移补原\n    C．移原朴浮    D．移补原浮",
        "17": "采用规格化的浮点数最主要是为了(    )。\n    A．增加数据的表示范围    B．方便浮点运算\n    C．防止运算时数据溢出    D．增加数据的表示精度",
        "18": "在浮点运算中，下溢指的是(    )。\n    A．运算结果的绝对值小于机器所能表示的最小绝对值\n    B．运算的结果小于机器所能表示的最小负数\n    C．运算的结果小于机器所能表示的最小正数\n    D．运算结果的最低有效位产生的错误",
        "19": "假定采用IEEE 754标准中的单精度浮点数格式表示一个数为45 100000H，则该数的值是(    )。\n    A．(+1.125)10x210    B．(+1.125)10x21l\n    C．(+0.125)10x211    D．(+0.125)10x210",
        "20": "设浮点数共12位。其中阶码含l位阶符共4位，以2为底，补码表示：尾数含1位数符共8位，补码表示，规格化。则该浮点数所能表示的最大正数是(    )。\n    A．27    B．28\n    C．28-1    D．27-1",
        "21": "机算机在进行浮点数的加减运算之前先进行对阶操作，若x的阶码大于y的阶码，则应将(    )。\n    A．x酌阶码缩小至与y的阶码相同，且使x的尾数部分进行算术左移\n    B．x的阶码缩小至与y的阶码相同，且使义的尾数部分进行算术右移\n    C．y的阶码扩大至与x的阶码相同，且使y的尾数部分进行算术左移\n    D．y的阶码扩大至与x的阶码相同，且使y的尾数部分进行算术右移",
        "22": "如果浮点数的尾数用补码表示，则下列(    )中的尾数是规格化数形式。\n    A．1.11000    B．0.01110\n    C．0.01010    D．l.000lo",
        "23": "设浮点数的基数为4，尾数用原码表示，则以下(    )是规格化的数。\n    A．1.001101    B．0.001101\n    C．1.011011    D．0.000010",
        "24": "已知X=0.875x2]，Y=0.625x22，设浮点数格式为阶符l位，阶码2位，数符l位，尾数3位，通过朴码求出Z-X-Y的二迸制浮点数规格化结果是(    )。\n    A．1011011    B．0111011\n    C．1001011    D．以上都不对",
        "25": "IEEE 754标准中的舍入模式可以用于二进制数也可以用于十进制数，在采用舍入到最接近且可表示的值时，蔷要舍入成两个有敬数字形式，(12.5)D应该舍入为(    )。\n    A．11    B．13    C．12    D．10",
        "26": "下列关于舍入的说法，正确的是(    )。\n    Ⅰ．不仅仅只有浮点数需要舍入，定点数在运算时也可能要舍入\n    Ⅱ．在浮点数舍入中，只有左规格化时可能要舍入\n    Ⅲ．在浮点数舍入中，只有右规格化时可能要舍入\n    Ⅳ．在浮点数舍入中，蠢、右规格化均可能要舍入\n    Ⅴ．舍入不一定产生误差\n    AⅠ、Ⅲ、Ⅴ   BⅠ、Ⅱ、Ⅴ\n    C．Ⅴ   D．Ⅰ、Ⅳ"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "242": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "ALU作为运算器的核心部件，其属于(    )。\n    A．时序逻辑电路    B．组合逻辑电路\n    C．控制器    D．寄存器",
        "2": "在串行进位的并行加法器中，影响加法器运算速度的关键因素是(    )。\n    A．门电路的级延迟    B．元器件速度\n    C．进位传递延迟    D．各位加法祷速度的不同",
        "3": "加法器中每一位的进位生成信号g为(    )。\n    A．Xi   Yi   B．XiYi\n    C．XiYiCi    D．Xi+Yi+Ci",
        "4": "用8片74181和两片741 82可组成(    )。\n    A．组内并行进位、组同串行进位的32位ALU\n    B．二级先行进位结构的32位ALU\n    C．组内先行进位、组间先行进位的l6位ALU\n    D．三级先行进位结构的32位ALU",
        "5": "组成一个运算器需要多个部件，但下面(    )不是组成运算器的部件。\n    A．状态寄存器    B．数据总线\n    C．ALU    D．地址寄存器",
        "6": "算术逻辑单元(ALU)的功能一般包括(    )。\n    A．算术运算    B．逻辑运算\n    C．算术运算和逻辑运算    D．加法运算",
        "7": "加法器采用并行进位的目的是(    )。\n    A．增强加法器功能    B．简化加法器设计\n    C．提高加法器运算速度    D．保证加法器可靠性"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    }
  },
  "3": {
    "312": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "【2011年计算机联考真题】\n下列存储器中，不采用随机存取方式的是（    ）：\n    A．EPROM     B．CDROM     C．DRAM    D．SRAM",
        "2": "磁盘属于（    ）类型的存储器．\n    A．随机存取存储器（RAM）       B．只读存储器（ROM）\n    C．顺序存取存储器（SAM）       D．直接存取储存器（DAM）",
        "3": "存储器的存取周期是指（    ）。\n    A．存储器的独处时间\n    B．存储器的写入时间\n    C．存储器进行连续或写操作所允许的最短时间间隔。\n    D．存储器进行一次读或写操作的平均时间。",
        "4": "主存储器速度的表示中，存取时间（Ta）和存取周期（Tc）的关系表述正确的是：\n    A．Ta>Tc       B．Ta<Tc       C．Ta = Tc  \n    D．Ta>Tc或Ta<Tc，根据不同存取方式和存取对象而定",
        "5": "设机器字长为32位一个容量为16MB的存储器，CPU按半字节寻址岂可寻址的单元数为（    ）\n    A．224    B．223    C．222    D 221  ",
        "6": "相联存储器是按（    ）进行寻址的存储器。\n    A．地址指方式        B．对战存储方式\n    C．内容指定方式和堆存储方式相结合  D．内存指定方式和地址指方式相结合",
        "7": "某计算机系统，其操作系统保存在硬盘上，其内存存储器应该采用（    ）\n    A．RAM    B．ROM    C．RAM和ROM    D．都不对",
        "8": "在下列几种存储器中，CPU 不能直接访问的是（    ）。\n    A．硬盘    B．内存    C．Cache    D．寄存器",
        "9": "若某存储器存储周期为250ns,每次读出16位，则该存储器的数据传输率是（    ）\n    A．4×106 B/s    B．4MB/s    C．8×106 B/s    D．8MB/s",
        "10": "设机器字长为64位，存储容量为128MB，若按字编址，他可寻址的单元个数是（    ）\n    A．16MB         B．16M         C．32M           D．32MB "
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "322": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "计算机的存储器采用分级方式是为了（    ）\n    A．方便变成  B．解决容量、速度、价格三者之间的矛盾\n    C．保存大量的数据方便  D．操作方便",
        "2": "计算机的存储系统是指（    ）\n    A．RAM     B. ROM   C. 主存储器   D. Cache、主存储器和外存储器",
        "3": "在多级存储体系中，“Cache—主存”结构的作用是解决（    ）问题。\n    A．主存容量不足     B．主存与辅存速度不匹配 \n    C．辅存与CPU速度不匹配    D．主存与CPU速度不匹配",
        "4": "（    ）存储结构对程序员是透明的。\n    A．通用寄存器  B．主存  C．控制寄存器 D．堆栈",
        "5": "存储器分层体系结构中，存储器从速度最快到最慢的排列顺序是(    )。\n    A．寄存器—主存—Cache —辅存  B．寄存器—主存—辅存—Cache\n    C．寄存器—Cache—辅存—主存  D．寄存器—Cache—主存—辅存",
        "6": "在Cache和主存构成的两级存储体系中，Cache的存取时间是100ns, 主存的存储时间是1000ns，如果希望有效（平均）存取时间按不超过Cache存取时间的115%，则Cache的命中率至少应为(    )。\n    A．90%    B．98%    C．95%    D．99%"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "332": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "某一SRAM芯片，其容量为1024×8位，除电源和接地端外，该芯片的引脚的最小数目为(    )\n    A．21                 B．22             C．23              D．24",
        "2": "某容器容量为32K×16位，则(    )\n    A.地址线为16根，数据线为32根    B．地址线为32根，数据线为16根   \n    C．地址线为16根，数据线为32根   D．地址线为16根，数据线为32根",
        "3": "若RAM中每个存储单元为l6位，则下面所述正确的是(    )。\n    A．地址线也是16位    B．地址线与l6无关\n    C．地址线与16有关    D.地址线不得少于l6位",
        "4": "DRAM的刷新是以(    )为单位的。\n    A.存储单元                         B.行\n    C．列                              D.存储字",
        "5": "动态RAM采用下列哪种刷新方式时，不存在死时间(    )。\n    A．集中刷新    B.分散刷新\n    C．异步刷新    D.都不对",
        "6": "下面是有关DRAM和SRAM存储器芯片的叙述：\n    Ⅰ．DRAM芯片的集成度比SRAM高\n    Ⅱ．DRAM芯片的成本比SRAM高\n    Ⅲ．DRAM芯片的速度比SRAM快\n    Ⅳ．DRAM芯片工作时需要刷新，SRAM芯片工作时不需要刷新\n通常情况下，错误的是(    )。\n    A．Ⅰ和Ⅱ    B．Ⅱ和Ⅲ\n    C．Ⅲ和Ⅳ    D．Ⅰ和Ⅳ",
        "7": "下列说法中，正确的是(    )。\n    A．半导体RAM信息可读可写，且断电后仍能保持记忆\n    B．DRAM是易失性RAM，而SRAM中的存储信息是不易失的\n    C．半导体RAM是易失性RAM，但只要电源不断电，所存信息是不丢失的\n    D．半导体RAM是非易失性的RAM",
        "8": "关于SRAM和DRAM．下列叙述中正确的是(    )。\n    A．通常SRAM依靠电容暂存电荷来存储信息，电容上有电荷为l，无电荷为0.\n    B．DRAM依靠双稳态电路的两个稳定状态来分别存储O和1.\n    C．SRAM速度较慢，但集成度稍高：DRAM速度稍快，但集成度低。\n    D．SRAM速度较快，但集成度稍低；DRAM速度稍慢，但集成度高。",
        "9": "某一DRAM芯片，采用地址复用技术，其容量为1024x8位，除电源和接地端外，该芯片的引脚数最少是(    )\n    A．16    B．17    C．19    D．21"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "342": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "【2010年计算机联考真题】\n下列有关RAM和ROM的叙述审，正确的是(    )。\n    Ⅰ．RAM是易失性存储器．ROM是非易失性存储器\n    Ⅱ．RAM和ROM都是采用随机存取的方式进行信息访问\n    Ⅲ．RAM和ROM都可用做Cache\n    Ⅳ．RAM和ROM都需要进行刷新\n    A．仅Ⅰ和Ⅱ   B．仅Ⅱ和Ⅲ    C．仅Ⅰ、Ⅱ和Ⅲ    D．仅Ⅱ、Ⅲ和Ⅳ",
        "2": "下列几种存储器中，(    )是易失性存储器。\n    A．Cache    B．EPROM\n    C． Flash Memory    D．CD-ROM",
        "3": "U盘属于(    )类型的存储器。\n    A．高速缓存    B．主存\n    C．只读存储器    D．随机存取存储器",
        "4": "某计算机系统，其操作系统保存于硬盘上，其内存储器应该采用(    )。\n    A．RAM          B．ROM\n    C．RAM和ROM    D．均不完善",
        "5": "下列说法正确的是(    )。\n    A．FPROM是可改写的，故而可以作为随机存储器\n    B．EPROM是可改写的，但不能作为随机存储器\n    C．EPROM是不可改写的，散而不能作为随机存储器\n    D．EPROM只能改写一次，故而不能作为随机存储器"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "352": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "【2009年计算机联考真题】\n某计算机主存容塞为64KB，其中ROM区为4KB．其余为RAM区，按字节编址。现要用\n2K×8位的ROM芯片和4Kx4位的RAM芯片来设计该存储器，则需要上述规格的ROM芯片数和RAM芯片数分别是(    )。\n    A．1、15    B．2、15    C．1、30    D．2、30",
        "2": "【2010年计算机联考真题】\n假定有若干个2K×4位的芯片组成一个8K×8位的存储器，则地址OB1FH所在芯片的最小地\n址是(    )。\n    A．OOOOH    B．0600H    C．0700H    D．0800H",
        "3": "【2011年计算机联考真题】\n某计算机存储器按字节编址，主存地址空间大小为64MB，现用4M y8位的RAM芯片组成32MB的主存储器，则存储器地址寄存器MAR的位数至少是(    )。\n    A．22位    B．23位    C．25位    D．26位",
        "4": "用存储容量为16Kxl位的存储器芯片来组成一个64K×8位的存储器，则在字方向和位方向分别扩展了(    )倍。\n    A．4、2    B．8、4    C．2、4    D．4、8",
        "5": "80386DX是32位系统，当在该系统中用8KB的存储芯片构造32KB的存储体时，应完成存储器的(    )设计。\n    A．位扩展       B．字扩展\n    C．字位扩展    D．字位均不扩展",
        "6": "某计算机字长为16位，存储器容量为256KB，CPU按字寻址，其寻址范围是(    )。\n    A．0～219-1    B．0～220-1\n    C．0～218-1    D．0～217-1",
        "7": "4个16K×8位的存储芯片，可设计为(    )容量的存储器。\n    A．32K×16位    B．16K×16位\n    C．32K×8位     D．8K×16位",
        "8": "16片2K×4位的存储器可以设计为(    )存储容量的16位存储器。\n    A．16K    B．32K\n    C．8K     D．2K",
        "9": "设CPU地址总线有24根，数据总线有32根，用512K×8位的RAM芯片构成该机的主存储器，则该机主存最多需要(    )片这样的存储芯片。\n    A．256         B．512\n    C．64          D．128",
        "10": "地址总线A0（高位）～A15（低位）．用4K×4位的存储芯片组成16KB存储器，则产生片选信号的译码器的输入地址线应该是(    )。\n    A．A2A3      B．A0A1      C．A12A13      D．A14A15",
        "11": "若内存地址区间为4000H～43FFH，每个存储单元可存储16位二进制数，该内存区域用4片存储器芯片构成，则构成该内存所用的存储器芯片的容量是(    )。\n    A．512×16bit    B．256×8bit    C．256×16bit    D．1024×8bit",
        "12": "内存按字节编址，地址从90000H到CFFFFH，若用存储容量为16K×8位芯片构成\n该内存，至少需要的芯片数是(    )。\n    A．2    B．4    C．8    D．16",
        "13": "如图3-12所示，若低位地址(A0～A11)接在内存芯片地址引脚上．高位地址(A12～A19)进行片选译码（其中，A14和A16没有参加译码），且片选信号低电平有效，则对图3-12所示的译码电路，不属于此译码空间的地址是(    )。\n    A．ABOOOH～ABFFFH                               B．BBOOOH～BBFFFH\n    C．EFOOOH～EFFFFH                               D．FEOOOH～FEFFFH"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "362": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "双端口RAM在(    )情况下会发生读／写冲突。\n    A．左端口和右端口的地址码不同\n    B．左端口和右端口的地址码相同\n    C．左端口和右端口的数据码不同\n    D．左端口和右端口的数据码相同",
        "2": "交叉存储器实际上是一种(    )的存储器，它能(    )执行多个独立的读/写操作。\n    A．模块式、并行    B．整体式、并行\n    C．模块式、串行    D．整体式、并行",
        "3": "己知单个存储体的存储周期为11Ons，总线传输周期为1Ons，则当采用低位交叉编址的多模块存储器时，存储体数应(    )。\n    A．小于11    B．等于11\n    C．大于11    D．大子等于11",
        "4": "一个四体并行低位交叉存储器，每个模块的容量是64Kx32位，存取周期为200ns，在下述说法中(    )是正确的。\n    A．在200ns内，存储器能向CPU提供256位二进制信息\n    B．在 200ns内，存储器能向CPU提供128位二进制信息\n    C．在50ns内，每个模块能向CPU提供32位二进制信息\n    D．以上都不对",
        "5": "某机器采用四体低位交叉存储器，现分别执行下述操作：①读取6个连续地址单元中存放的存储字，重复80次；②读取8个连续地址单元中存放的存储字，重复60次。则①、②所花费的时间之比为(   )\n    A．1：1        B．2：1        C．4：3       D．3：4"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "372": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "在高速缓存系统中，主存容量为12MB，Cache容量为400KB，则该存储系统的容量为(    )\n    A．12MB+400KB    B.12MB    C．12MB～12MB+400KB    D．12MB-400KB",
        "2": "【2009年计算机联考真题】\n假设某计算机的存储系统由Cache和主存组成，某程序执行过程中访存1000次，其中访问Cache缺失（未命中）50次，则Cache的命中率是(    )。\n    A．5%    B．9.5%    C．50%    D．95%",
        "3": "【2009年计算机联考真是】\n某计算机的Cache共有16块，采用二路组相联映射方式（即每组2块）。每个主存块大小为32B．按字节编址，主存129号单元所在主存块应装入到的Cache组号是(    )。\n    A．O    B．2    C．4    D．6",
        "4": "在写操作时，对Cache与主存单元同时修改的方法称做(    )，若每次只暂时写入Cache，直到替换时才写入主存的方法称做(    )。\n    A．写直达法    B．写回法\n    C．写一次法    D．都不对",
        "5": "关于Cache的更新策略，下列说法正确的是(    )。\n    A．读操作时，写直达法和写回法在命中时应用\n    B．写操作时，写回法和按写分配法在命中时应用\n    C．读操作时，写直达法和按写分配法在失效对应用\n    D．写操作时，按写分配法、不按写分配法在失效时应用",
        "6": "某虚拟存储器系统采用页式内存管理，使用LRU页面替换算法，考虑下面的页面访问地址流（每次访问在一个时间单位中完成）：\n    1  8  1  7  8  2  8  2  1  8  3  8  2  1  3  1  7  1  3  7\n    假定内存容量为4个页面，开始时是空的，则页面失效次数是(    )。\n    A．30%    B．5%   C．1．5%   D．15%",
        "7": "某32位计算机的Cache容疑为16KB．Cache行的大小为16B，若主存与Cache地址映像采用直接映像方式，则主存地址为Ox1234E8F8的单元装入Cache的地址是(    )。\n    A．00010001001101    B．01000100011010\n    C．10100011111000    D．11010011101000",
        "8": "在Cache中，常用的替换策略有：随机法（RAND）、先进先出法(FIFO)、近期最少使用法（LRU）．其中与局部性原理有关的是(    )。\n    A．随机法（RAND）B．先进先出法(FIFO)  C．近期最少使用法( LRU) D．都不是",
        "9": "某存储系统中，主存容量是Cache容量的4096倍，Cache被分为64个块，当主存地址和Cache地址采用直接映像方式时，地址映射表的大小应为(    )。(假设不考虑一致\n维护和替换算法位）\n    A．6×4097bit    B．64×12bit    C．6×4096bit    D．64×13bit",
        "10": "有一主存-Cache层次的存储器，其主存容量为1MB，Cache容量为16KB．每字块\n有8个字，每字32位，采用直接地址映像方式，若主存地址为35301H，且CPU访问Cache命中，则在Cache的第(    )（十进制表示）字块中（Cache起始字块为第0字块）。\n    A．152    B．153\n    C．154    D．151",
        "11": "若由高速缓存、主存，硬盘构成的三级存储体系，则CPU访问该存储系统时发送的地址为(    )。\n    A．高速缓存地址    B．虚拟地址\n    C．主存物理地址    D．磁盘地址"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "382": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "为使虚拟存储系统有效地发挥其预期的作用，所运行的程序应具有的特性是(    )。\n    A．不应含有过多的I/O操作    B．大小不应小于实际的内存容量\n    C．应具有较好的局部性       D．顺序执行的指令不应过多",
        "2": "虚拟存储管理系统的基础是程序访问的局部性原理，此理论的基本含义是(    )。\n    A．在程序的执行过程中，程序对主存的访问是不均匀的\n    B．空间局部性\n    C．时间局部性\n    D．代码的顺序执行",
        "3": "虚拟存储器管理方式常用的有段式、页式、段页式，它们在与主存交换信息时的单位\n以下表述正确的是(    )。\n    A．段式采用“页”              B．页式采用“块”\n    C．段页式采用“段”和“页”    D．页式和段页式均仅采用“页”",
        "4": "【2010年计算机联考真题】\n下列命令组合情况中，一次访存过程中，不可能发生的是(    )。\n    A．TLB未命中，Cache未命中，Page未命中\n    B．TLB未命中，Cache命中，Page命中\n    C．TLB命中．Cache未命中，Page命中\n    D．TLB命中，Cache命中，Page未命中",
        "5": "下列关于虚存的叙述中，正确的是(    )。\n    A．对应用程序员透明，对系统程序员不透明\n    B．对应用程序员不透明，对系统程序员透明\n    C．对应用程序员、系统程序员都不透明\n    D．对应用程序员、系统程序员都透明",
        "6": "在虚拟存储器中，当程序正在执行时，由(    )完成地址映射。\n    A．程序员    B．编译器  C．装入程序    D．操作系统",
        "7": "采用虚拟存储器的主要目的是(    )。\n    A．提高主存储器的存取速度\n    B．扩大主存储器的存储空间\n    C．提高外存储器的存取速度\n    D．扩大外存储器的存储空间",
        "8": "关于虚拟存储器，下列说法正确的是(    )。\n    Ⅰ．虚拟存储器利用了局部性原理\n    Ⅱ．页式虚拟存储器的页面如果很小，主存中存放的页面数较多，导致缺页频率较低，换页次数减少，最终可以提升操作速度\n    Ⅲ．页式虚拟存储器的页面如果很大，主存中存放页面数较少，导致页面调度频率较高．换页次数增加，降低操作速度\n    Ⅳ，段式虚拟存储器中，段具有逻辑独立性，易于实现程序的编译、管理和保护，也便于多道程序共享\n    A．Ⅰ、Ⅲ、Ⅳ    B．Ⅰ、Ⅱ、Ⅲ\n    C．Ⅰ、Ⅱ、Ⅳ    D．Ⅱ、Ⅲ、Ⅳ",
        "9": "虚拟存储器中的页表有快表和慢表之分，下面关于页表的叙述中正确的是()。\n    A．快表与慢表都存储在主存中，但快表比慢表容量小\n    B．快袭采用了优化的搜索算法，因此查找速度快\n    C．快表比慢表的命中率高，因此快表可以得到更多的搜索结果\n    D．快表采用快速存储器件组成，按照查找内容访问，因此比慢表查找速度快"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    }
  },
  "4": {
    "412": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "以下有关指令系统的说法中错误的是(    )。\n    A．指令系统是一台机器硬件能执行的指令全体\n    B．任何程序运行前都要先转化为机器语言程序\n    C．指令系统是计算机软件、硬件的界面\n    D．指令系统和机器语言是无关的",
        "2": "在CPU执行指令的过程中，指令的地址由(    )给出。\n    A．程序计数器PC    B．指令的地址码手段\n    C．操作系统    D．程序员",
        "3": "下列一地址运算类指令的叙述中，正确的是(    )\n    A．仅有一个操作数，其地址由指令的地址码提供\n    B．可能有一个操作数，也可能有两个操作数\n    C．一定有两个操作数，其中一个操作数是隐含的\n    D．指令的地址码字段存放的一定是操作码",
        "4": "运算型指令的寻址与转移型指令的寻址不同点在于(    )。\n    A．前者取操作数．后者决定程序转移地址\n    B．后者取操作数，前者决定程序转移地址\n    C．前者是短指令，后者是长指令\n    D．前者是长指令，后者是短指令",
        "5": "5．程序控制类指令的功能是(    )。\n    A．进行算术运算和逻辑运算    B．进行主存与CPU之间的数据传送\n    C．进行CPU和I/O设备之间的数据传送    D．改变程序执行的顺序",
        "6": "下列哪种指令不属于程序控制指令(    )。\n    A．无条件转移指令    B．条件转移指令\n    C．中断隐指令    D．循环指令",
        "7": "下列哪种指令用户不准使用(    )。\n    A．循环指令    B．转换指令\n    C．特权指令    D．条件转移指令",
        "8": "零地址的运算类指令存指令格式中不给出操作数的地址，参加的两个操作数来自(    )。\n    A．累加器和寄存器    B．累加器和暂存器\n    C．堆栈的栈顶和次栈顶单元    D．堆栈的栈顶单元和暂存器",
        "9": "以下叙述错误的是(    )。\n    A．为了充分利用存储空问，指令的K度通常为字节的整数倍\n    B．单地址指令是固定长度的指令\n    C．单字长指令可加快取指令的速度\n    D．单地址指令可能有一个操作数，也可能有两个操作数",
        "10": "单地址指令中为了完成两个数的算术运算，除地址码指明一个操作数外，另一个数采用(    )方式。\n    A．立即寻址    B．隐含寻址\n    C．间接寻址    D．基址寻址",
        "11": "关于二地址指令以下论述正确的是(    )。\n    A． 二地址指令中，运算结果通常存放在其中一个地址码所提供的地址中\n    B．二地址指令中，指令的地址码字段存放的一定是操作数\n    C．二地址指令中，指令的地址码字段存放的一定是寄存器号\n    D．二地址指令中，指令的地垃码字段存放的一定是操作数地址",
        "12": "四地址指令OP A1，A2，A3，A4的功能为(A1)OP(A2)—A3，且A4给出下一条指令地址，假设A1、A2、A3、A4都为主存地址，则完成上述指令最少需要访存(    )次．\n    A．3    B．4    C．5    D．6",
        "13": "设机器字长为32位，一个容量为16MB的存储器，CPU按半字寻址，其寻址单元数是(    )。\n    A．224    B．223\n    C．222    D．221",
        "14": "某指令系统有200条指令，对操作码采用固定长度二进制编码，最少需要用(    )位。\n    A．4    B．8    C．16    D．32",
        "15": "指令格式中，采用扩展操作码设计方案的目的是(    )。\n    A．减少指令字长度\n    B．增加指令子长度\n    C．保持指令字长度不变而增加指令操作的数量\n    D．保持指令字长度不变而增加寻址空间",
        "16": "一个计算机系统采用32位单字长指令，地址码为12位，如果定义了250条二地址指令，那么还可以有(    )条单地址指令。\n    A．4K    B．8K\n    C．16K    D．24K"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "422": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "【2009年计算机联考真题】\n某机器字长为l6位，主存按字节编址，转移指令采用相对寻址，由两个字节组成，第一字节为操作码字段，第二字节为相对位移量字段。假定取指令时，每取一个字节PC自动加1。若某转移指令所在主存地址为2000H，相对位移量字段的内容为06H．则该转移指令成功转移以后的目标地址是(    )。\n    A．2006H    B．2007H\n    C．2008H    D．2009H",
        "2": "【2011年计算机联考真题】\n偏移寻址通过将某个寄存器内容与一个形式地址相加而生成有效地址。下列寻址方式中，不属于偏移寻址方式的是(    )。\n    A．间接寻址    B．基址寻址    C．相对寻址    D．变址寻址",
        "3": "指令系统中采用不同寻址方式的目的是(    >，\n    A．可降低指令译码的复杂度\n    B．可缩短指令字长，扩大寻址空间，提高编程的灵活性\n    C．实现程序控制\n    D．三者都正确",
        "4": "直接寻址的无条件转移指令的功能是将指令中的地址码送入(    )。\n    A．程序计数器PC    B．累加器ACC\n    C．指令寄存器IR    D．地址寄存器MAR",
        "5": "为了缩短指令中某个地址段的位数，有效的方法是采取(    )。\n    A．立即寻址    B．变址寻址\n    C．间接寻址    D．寄存器寻址",
        "6": "简化地址结构的基本方法足尽量采用(    )。\n    A．寄存器寻址    B．隐地址\n    C．直接寻址    D．间接寻址",
        "7": "在指令寻址的各种方式中，获取操作数最快的方式是(    )。\n    A．直接寻址    B．立即寻址\n    C．寄存器寻址    D．间接寻址",
        "8": "假定指令中地址码所给出的是操作数的有效地址，则该指令采用(    )。\n    A．直接寻址    B．立即寻址\n    C．寄存器寻址    D．间接寻址",
        "9": "设指令中的地址码为A．变址寄存器为X．程序计数器为PC，则变址间址寻址方式的操作数有效地址EA是(    )。\n    A．((PC)+A)    B．((X)+A)\n    C．(X)+(A)    D．(X)+A",
        "10": "(    )便于处理数组问题。\n    A．间接寻址    B．变址寻址\n    C．相对寻址    D．基址寻址",
        "11": "堆栈寻址方式中，设A为累加器，SP为堆栈指示器，Msp为SP指示的栈顶单元。如果进栈操作的动作是：(A)→Msp，(SP)-1→SP，那么出栈操作的动作应为(    )。\n    A． (Msp)→A,(SP)+1→SP    B． (SP)+1→SP,(Msp)→A\n    C． (SP)-1→SP,(Msp)→A    D． (Msp)→A,(SP)-1→SP",
        "12": "相对寻址方式中，指令所提供的相对地址实质上是一种(    )。\n    A．立即数\n    B．内存地址\n    C．以本条指令在内存中首地址为基准位置的偏移量\n    D．以下条指令在内存中首地址为基准位置的偏移量",
        "13": "变址寻址、相对寻址的特点是(    )。\n    A．利于编制循环程序、实现程序浮动\n    B．实现程序浮动、处理数组问题    \n    C．实现转移指令、利于编制循环程序\n    D．实现程序浮动、利于编制循环程序",
        "14": "在多道程序设计中，最重要的寻址方式是(    )。\n    A．相对寻址    B．间接寻址\n    C．立即寻址    D．按内容寻址",
        "15": "指令寻址方式有顺序和跳跃两种，采用跳跃寻址方式可以实现(    )。\n    A．程序浮动    B．程序的无条件浮动和条件浮动\n    C．程序的无条件转移和条件转移  D．程序的调用",
        "16": "某机器指令字长为l6位，主存按字节编址，取指令时，每取一个字节PC自动加1。当前指令地址为2000H，指令内容为相对寻址的无条件转移指令．指令中的形式地址为40H。那么取指令后及指令执行后PC内容为(    )。\n    A． 2000H, 2042H    B． 2002H, 2040H\n    C． 2002H, 2042H    D． 2000H, 2040H",
        "17": "程序计数器和指令寄存器的位数各取决于(    )。\n    A．机器字长，存储器的容量    B．存储器的容量，指令字长\n    C．指令字长，机器字长    D．地址总线宽度，存储器容量",
        "18": "假设某条指令的第一个操作数采用寄存器间接寻址方式，假定指令中给出的寄存器编号为8，8号寄存器的内容为1200H，地址为1200H单元中的内容为12FCH，地址为12FCH单元中的内容为38D8H．而38D8H单元中的内容为88F9H．则该操作数的有效地址为(    )。\n    A．1200H    B． 12FCH\n    C．38D8H    D．88F9H",
        "19": "关于指令的功能及分类，下列叙述中正确的是(    )。\n    A．算术与逻辑运算指令，通常完成算术运算或逻辑运算，都需要两个数据\n    B．移位操作指令，通常用于把指定的两个操作数左移或右移一位\n    C．转移指令、子程序调用与返回指令，用于解决数据调用次序的需求\n    D．特权指令，通常仅用于实现系统软件，这类指令一般不提供给用户"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "432": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "以下叙述中(    )是正确的。\n    A． RISC机一定采用流水技术\n    B．采用流水技术的机器一定是RISC机\n    C．CISC机一定不采用流水技术\n    D．以上答案均不正确",
        "2": "【2009年计算机联考真题】\n下列关于RISC说法中，错误的是(    )。\n    A． RISC普遍采用微程序控制器\n    B．RISC大多数指令在一个时钟周期内完成\n    C． RTSC的内部通用寄存器数量相对CISC多\n    D． RISC的指令数、寻址方式和指令合适种类相对CISC少",
        "3": "【2011年计算机联考真题】\n下列给出的指令系统特点中，有利于实现指令流水线的是(    )。\n    Ⅰ．指令格式规整且长度一致    Ⅱ．指令和数据按边界对齐存放\n    Ⅲ．只有Load/Store指令才能对操作数进行存储访问\n    A．仅Ⅰ、Ⅱ    B．仅Ⅱ、Ⅲ    C．仅Ⅰ、Ⅲ    D．Ⅰ、Ⅱ、Ⅲ",
        "4": "下列描述中，不符合RISC指令系统特点是(    )。\n    A．指令长度固定，指令种类少\n    B．寻址方式种类尽量减少，指令功能尽可能强\n    C．增加寄存器的数目，以尽量减少访存次数\n    D．选取使用频率最高的一些简单指令，以及很有用但不复杂的指令",
        "5": "以下有关RISC的描述中，描述正确的是(    )。\n    A．为了实现兼容，各公司新设计的RISC，是从原来CISC系统的指令系统中挑选一部分实现的\n    B．早期的计算机比较简单，采用RISC技术后，计算机的体系结构又恢复到了早期的情况\n    C．RISC的主要目标是减少指令数，因此允许以增加每条指令的功能的方法来减少指令系统包含的指令数\n    D．以上说法都不对"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    }
  },
  "5": {
    "512": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "【2011年计算机联考真题】\n某机器有一个标志寄存器，其中有进位／借位标志CF、零标志ZF、符号标志SF和溢出标志OF，条件转移指令bgt（无符号整数比较大子时转移）的转移条件是(    )。\n    A．CF+OF=l    B．SF(——)+ZF=1    C．CF+ZF(—————)=1    D．CF+SF(—————)=1",
        "2": "【2010年计算机真题】\n下列寄存器中，汇编语言程序员可见的是(    )。\n    A．储器地址寄存器(MAR)\n    B．程序计数器(PC)\n    C．存储区数据寄存器(MDR)\n    D．指令寄存器(IR)",
        "3": "下列部件不属于控制器的是(    )。\n    A．指令寄存器    B．程序计数器\n    C．程序状态字    D．时序电路",
        "4": "通用寄存器是(    )。\n    A．可存放指令的寄存器    B．可存放程序状态字的寄存器\n    C．本身具有计数逻辑与移位逻辑的寄存器  D．可编程指定多种功能的寄存器",
        "5": "CPU中保存当前正在执行指令的寄存器是(    )。\n    A．指令寄存器    B．指令译码器\n    C．数据寄存器    D．地址寄存器",
        "6": "在CPU中，跟踪后继指令地址的寄存器是(    )。\n    A．指令寄存器    B．程序计数器\n    C．地址寄存器    D．状态寄存器",
        "7": "条件转移指令执行时所依据的条件来自(    )。\n    A．指令寄存器    B．标志寄存器\n    C．程厣计数器    D．地址寄存器",
        "8": "所谓n位的CPU，这里的n是指(    )。\n    A．地址总线线数    B．数据总线线数\n    C．控制总线线数    D． I/O线数",
        "9": "在CPU的寄存器中，(    )对用户是透明的。\n    A．程序计数器    B．状态寄存器\n    C．指令寄存器    D．通用寄存器",
        "10": "程序计数器(PC)属于(    )。\n    A．运算器    B．控制器\n    C．存储器    D．ALU",
        "11": "下面有关程序计数器(PC)的叙述中，错误的是(    )。\n    A． PC中总是存放指令地址\n    B．PC的值由CPU在执行指令过程中进行修改\n    C．转移指令时，PC的值总是修改为转移目标指令的地址\n    D． PC的位数一般和存储器地址寄存器(MAR)的位数一样",
        "12": "在一条无条件跳转指令的指令周期内，PC的值被修改(    )次。\n    A．1    B．2    C．3    D．无法确定",
        "13": "程序计数器的位数取决于(    )。\n    A．存储器的容量    B．机器字长\n    C．指令字长    D．都不对",
        "14": "指令寄存器的位数取决于(    )。\n    A．存储器的容量    B．机器字长\n    C．指令字长    D．存储字长",
        "15": "CPU中通用寄存器的位数取决于(    )。\n    A．存储器的容量．    B．指令的长度\n    C．机器字长    D．都不对",
        "16": "CPU中的通用寄存器，(    )。\n    A．只能存放数据，不能存放地址\n    B．可以存放数据和地址\n    C．既不能存放数据，也不能存放地址\n    D．可以存放数据和地址，还可以替代指令寄存器",
        "17": "在计算机系统中表征程序和机器运行状态的部件是(    )。\n    A．程序计数器    B．累加寄存器\n    C．中断寄存器    D．程序状态宇寄存器",
        "18": "数据寄存器中既能存放源操作数，又能存放结果的是(    )。\n    A．锁存器    B．堆栈\n    C．累加器    D．触发器",
        "19": "状态寄存器用来存放(    )。\n    A．算术运算结果\n    B．逻辑运算结果\n    C．运算类型\n    D．算术、逻辑运算及测试指令的结果状态",
        "20": "控制器的全部功能是(    )。\n    A．产生时序信号\n    B．从主存中取出指令并完成指令操作码译码\n    C．从主存中取出指令、分析指令并产生有关的操作控制信号\n    D．都不对",
        "21": "指令译码是对(    )进行译码。\n    A．整条指令    B．指令的操作码字段\n    C．指令的地址码字段    D．指令的地址",
        "22": "CPU中不包括(    )。\n    A．存储器地址寄存器    B．指令寄存器\n    C．地址译码器    D,程序计数器",
        "23": "以下关于计算机系统中的概念，正确的是(    )。\n    Ⅰ．CPU中不包括地址译码器\n    Ⅱ．CPU中程序计数器中存放的是操作数地址\n    Ⅲ．CPU中决定指令执行顺序的是程序计数器\n    Ⅳ．在CPU中状态寄存器对用户是完全透明的\n    A．Ⅰ、Ⅱ    B．Ⅲ、Ⅳ    C．Ⅱ、Ⅲ、Ⅳ    D．  Ⅰ、Ⅲ、Ⅳ",
        "24": "间址周期结束时，CPU内寄存器MDR中的内容为(    )。\n    A．指令    B．操作数地址\n    C．操作数    D．无法确定"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "522": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "【2009年计算机联考真题】\n冯·诺依曼计算机中指令和数据均以二进制形式存放在存储器中，CPU区分它们的依据是(    )。\n    A．指令操作码的译码结果    B．指令和数据的寻址方式\n    C．指令周期的不同阶段    D．指令和数据所在的存储单元",
        "2": " C．指令周期的不同阶段    D．指令和数据所在的存储单元\n2．【2011年计算机联考真题】\n假定不采用Cache和指令预取技术，且机器处于“开中断”状态，则在下列有关指令执行的叙述中，错误的是(    )。\n    A．每个指令周期中CPU都至少访问内存一次\n    B．每个指令周期一定大于或等于一个CPU时钟周期\n    C．空操作指令的指令周期中任何寄存器的内容都不会被改变\n    D．当前程序在每条指令执行结束时都可能被外部中断打断",
        "3": "计算机工作的最小时间周期是(    )。\n    A．时钟周期    B．指令周期\n    C．CPU周期    D．工作脉冲",
        "4": "采用DMA方式传递数据时，每传送一个数据就要占用(    )。\n    A．指令周期    B．时钟周期\n    C．机器周期    D．存取周期",
        "5": "指令周期是指(    )。\n    A． CPU从主存取出一条指令的时间\n    B．CPU执行一条指令的时间\n    C． CPU从主存取出一条指令加上执行这条指令的时间\n    D．时钟周期时间",
        "6": "指令(    )从主存中读出。\n    A．总是根据程序计数器\n    B．有时根据程序计数器．有时根据转移指令\n    C．根据地址寄存器\n    D．有时根据程序计数器，有时根据地址寄存器",
        "7": "在取指操作后，程序计数器中存放的是(    )。\n    A．当前指令的地址    B．程序中指令的数量\n    C．已执行的指令数量    D．下一条指令的地址",
        "8": "以下叙述中错误的是(    )。\n    A．指令周期的第一个操作是取指令\n    B．为了进行取指操作，控制器需要得到相应的指令\n    C．取指操作是控制器自动进行的\n    D．指令执行时有些操作是相同或相似的",
        "9": "指令周期由一个到几个机器周期组成，在第一个机器周期是(    )。\n    A．从主存中取出指令字    B．从主存中取出指令操作码\n    C．从主存中取出指令地址码    D．从主存中取出指令的地址",
        "10": "由于CPU内部操作的速度较快，而CPU访问一次存储器的时间较长，因此机器周期通常由(    )．来确定。\n    A．指令周期    B．存取周期\n    C．间址周期    D．中断周期",
        "11": "以下有关机器周期的叙述中，错误的是(    )。\n    A．通常把通过一次总线事务访问一次主存或I/O的时间定为一个机器周期\n    B．一个指令周期通常包含多个机器周期\n    C．不同的指令周期所包含的机器周期数可能不同\n    D．每个指令周期都包含一个中断响应机器周期",
        "12": "下列说法中，合理的是(    )。\n    A．执行各条指令的机器周期数相同，各机器周期的长度均匀\n    B．执行各条指令的机器周期数相同，各机器周期的长度可变\n    C．执行各条指令的机器周期数可变，各机器周期的长度均匀\n    D．执行各条指令的机器周期数可变，各机器周期的长度可变",
        "13": "以下关于间址周期的描述中正确的是(    )。\n    A．所有指令的间址操作都是相同的\n    B．凡是存储器间接寻址的指令，它们的操作都是相同的\n    C．对于存储器间接寻址和寄存器间接寻址，它们的操作是不同的\n    D．都不对",
        "14": "CPU响应中断的时间是(    )。\n    A．一条指令执行结束    B．I/O设备提出中断\n    C．取指周期结束    D．指令周期结束",
        "15": "以下叙述中，错误的是(    )。\n    A．取指操作是控制器固有的功能，不需要在操作码控制下完成\n    B．所有指令的取指操作是相同的\n    C．在指令长度相同的情况下，所有指令的取指操作是相同的\n    D．中断周期是在指令执行完成后出现的",
        "16": "(    )可区分存储单元中存放的是指令还是数据。\n    A．控制器    B．运算器\n    C．存储器    D．数据通路",
        "17": "下列说法正确的是(    )。\n    Ⅰ．指令字长等于机器字长的前提下，取指周期等于机器周期\n    Ⅱ，指令字长等于存储字长的前提下，取指周期等于机器周期\n    Ⅲ．指令字长和机器字长的长度没有任何关系\n    Ⅳ．为了硬件设计方便．指令字长都和存储字长一样大\n    A．Ⅱ、Ⅲ    B．Ⅱ、Ⅲ、Ⅳ\n    C．Ⅰ、Ⅲ、Ⅳ    D．Ⅰ、Ⅳ"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "532": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "下列不属于CPU内部数据通路结构的是(    )。\n    A．单总线结构    B.多总线结构\n    C．部件内总线结构    D．专用数据通路结构",
        "2": "在单总线的CPU中(    )。\n    A．ALU的两个输入端及输出端都可与总线相连\n    B．ALU的两个输入端可与总线相连，但输出端需通过暂存器与总线相连\n    C．ALU的一个输入端可与总线相连，其输出端也可与总线相连\n    D．ALU只能有一个输入端可与总线相连，另一输入端需通过暂存器与总线相连",
        "3": "采用CPU总线结构的数据通路与不采用CPU内部总线的数据通路相比(    )。\n    A.前者性能较高    B.后者的数据冲突问题较严重\n    C．前者的硬件量大，实现难度高    D.以上说法都不对",
        "4": "CPU的读／写控制信号的作用是(    )。\n    A.决定数据总线上的数据流方向    B．控制存储器操作的读，写类型\n    C．控制流入、流出存储器信息的方向    D.以上都是"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "542": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "【2009年计算机联考真题】\n相对于微程序控制器，硬布线控制器的特点是(    )。\n    A．指令执行速度慢，指令功能的修改和扩展容易\n    B．指令执行速度慢，指令功能的修改和扩展难\n    C．指令执行速度快，指令功能的修改和扩展容易\n    D．指令执行速度快，指令功能的修改和扩展难",
        "2": "取指令操作(    )。\n    A．受到上一条指令的操作码控制\n    B．受到当前指令的操作码控制\n    C．受到下一条指令的操作码控制\n    D．是控制器固有的功能，不需要在操作码控制下进行",
        "3": "在组台逻辑控制器中，微操作控制信号的形成主要与(    )信号有关。\n    A．指令操作码和地址码    B．指令译码信号和时钟\n    C．操作码和条件码    D．状态信息和条件",
        "4": "微程序控制器中，形成微程序入口地址的是(    )。\n    A．机器指令的地址码字段    B．微指令的微地址码字段\n    C．机器指令的操作码字段    D．微指令的微操作码字段",
        "5": "下列不属于微指令结构设计所追求的目标是(    )。\n    A．提高微程序的执行速度    B．提供微程序设计的灵活性\n    C．缩短微指令的长度    D．增大控制存储器的容量",
        "6": "微程序控制器的速度比硬布线控制器慢，主要是因为(    )。\n    A．增加了从磁盘存储器读取微指令的时间\n    B．增加了从主存读取微指令的时间\n    C．增加了从指令寄存器读取微指令的时间\n    D．增加了从控制存储器读取微指令的时间",
        "7": "以下说法正确的是(    )。\n    A．采用微程序控制器是为了提高速度\n    B．控制存储器采用高速RAM电路组成\n    C．为指令计数器决定指令执行顺序\n    D．一条微指令存放在控制器的一个单元中",
        "8": "硬布线控制器与微程序控制器相比(    )。\n    A．硬布线控制器的时序系统比较简单\n    B．微程序控制器的时序系统比较简单\n    C．两者的时序系统复杂程度相同\n    D．可能是硬布线控制器的时序系统比较简单，也可能是微程序控制器的时序系统比较简单",
        "9": "微程序控制器中，控制部件向执行部件发出的某个控制信号称为(    )。\n    A．微程序    B．微指令    C．微操作    D．微命令",
        "10": "在微程序控制器中，机器指令与微指令的关系是(    )。\n    A．每一条机器指令由一条微指令来执行\n    B．每一条机器指令由若干微指令组成的微程序来解释执行\n    C．若干条机器指令组成的程序可由一个微程序来执行\n    D．每一条机器指令由若干微程序执行",
        "11": "微指令格式分为水平型和垂直型，水平型微指令的位数(①)．用它编写的微程序(②)。\n    A．较少    B．较多\n    C．较长    D．较短",
        "12": "水平型微指令与垂直型微指令相比(    )。\n    A．前者一次只能完成一个操作    B．后者一次只能完成一个操作\n    C．两者都是一次只能完成一个操作    D．两者都能一次完成多个操作",
        "13": "某计算机指令系统共有101种操作，采用微程序控制方式时，控制存储器中相应有(  )    个微程序。\n    A．101    B．l02\n    C．103    D．104",
        "14": "兼容性微命令指几个微命令是(    )。\n    A．可以同时出现的    B．可以相继出现的\n    C．可以相互代替的    D．可以相处容错的",
        "15": "在微程序控制方式中，以下说法正确的是(    )。\n    Ⅰ．采用微程序控制器的处理器称为微处理器\n    Ⅱ．每一条机器指令由一段微程序来解释执行\n    Ⅲ．在微指令的编码中，效率最低的是直接编码方式\n    Ⅳ．水平型微指令能充分利用数据通路的并行结构\n    A．Ⅰ、Ⅱ    B．Ⅱ、Ⅳ    C．Ⅰ、Ⅲ    D．Ⅲ、Ⅳ",
        "16": "下列说法正确的是(    )。\n    Ⅰ．微程序控制方式和硬布线方式相比较，前者可以使指令的执行速度更快\n    Ⅱ．若采用微程序控制方式，则可用LiPC取代PC\n    Ⅲ．控制存储器可以用ROM实现\n    Ⅳ．指令周期也称为CPU周期\n    A．Ⅰ、Ⅲ    B．Ⅱ、Ⅲ    C．只有Ⅲ    D．Ⅰ、Ⅲ、Ⅳ",
        "17": "通常情况下，微指令的周期对应一个(    )。\n    A．指令周期    B．主频周期    C．机器周期    D．工作周期",
        "18": "下列部件中属于控制部件的是(    )。\n    Ⅰ．指令寄存器    Ⅱ．操作控制器\n    Ⅲ．程序计数器    Ⅳ，状态条件寄存器\n    A．Ⅰ、Ⅲ、Ⅳ    B．Ⅰ、Ⅱ、Ⅲ\n    C．Ⅰ、Ⅱ、Ⅳ    D．Ⅰ、Ⅱ、Ⅲ、Ⅳ",
        "19": "下例部件中属于执行部件的是(    )。\n    Ⅰ．控制器    Ⅱ．存储器    ．\n    Ⅲ．运算器    Ⅳ．外围设备\n    A．Ⅰ，Ⅲ、Ⅳ    B．Ⅱ、Ⅲ、Ⅳ\n    C．Ⅱ、Ⅳ    D．Ⅰ、Ⅱ、Ⅲ、Ⅳ"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "552": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "【2010计算机联考真题】\n下列不会引起指令流水线阻塞的是(    )。\n    A．数据旁路\n    B．数据相关\n    C．条件转移\n    D．资源冲突",
        "2": "某计算机的指令流水线由4个功能段组成，指令流经各功能段的时间（忽略各功能段\n的缓存时间）分别为90ns、80ns、70ns、和60ns，则该计算机的CPU时钟周期至少是(    )  。\n    A．90ns    B．80ns\n    C．70ns    D．60ns",
        "3": "下列描述流水CPU基本概念正确的句子是(    )。\n    A．流水CPU是以空间并行性为原理构造的处理器\n    B．流水CPU 一定是RISC机器\n    C．流水CPU 一定是多媒体CPU\n    D．流水CPU是一种非常经济而实用的时间并行技术",
        "4": "下列关于超标量流水线不正确的是(    )。\n    A．在一个时钟周期内一条流水线可执行一条以上的指令\n    B．一条指令分为多段指令来由不同电路单元完成\n    C．超标量是通过内置多条流水线来同时执行多个处理器，其实质是以空问换取时间\n    D．超标量流水线是指运算操作并行",
        "5": "下列关于动态流水线正确的是(    )。\n    A．动态流水线是在同一时间内，当某些段正在实现某种运算时，另-些段却正在进行另一种运算，这样对提高流水线的效率很有好处，但会使流水线控制变得很复杂\n    B．动态流水线是指运算操作并行\n    C．动态流水线是指指令步骤并行\n    D．动态流水线是指程序步骤并行",
        "6": "流水CPU是由一系列叫做“段”的处理线路组成的。和具有m个并行部件的CPU相比，一个m段流水线CPU(    )。\n    A．具有同等水平的吞吐能力    B．不具备同等水平的吞吐能力\n    C．吞吐能力大于前者的吞吐能力    D．吞吐能力小于前者的吞吐能力",
        "7": "设指令由取指、分析、执行3个子部件完成，并且每个子部件的时间均为Δt，若采用常 规标量单流水线处理机（即处理机的度为1）．连续执行12条指令，共需(    )。\n    A．12Δt    B．14Δt    C．16Δt    D．18Δt",
        "8": "若采用度为4的超标量流水线处理机，连续执行上述20条指令，只需(    )。\n    A．3Δt    B．5Δt    C．7Δt    D．9Δt",
        "9": "设指令流水线把一条指令分为取指、分析、执行3个部分，且3部分的时间分别是t提取=2ns，t分析=2ns，t执行=1ns，则100条指令全部执行完毕需(    )。\n    A．163ns    B．183ns    C- 193ns    D．203ns",
        "10": "设指令由取指、分析、执行3个予部件完成，并且每个子部件的时间均为t，若采用常规标量单流水线处理机，连续执行8条指令，则该流水线的加速比为(    )。\n    A．3    B．2    C．3,4    D．2,4",
        "11": "指令流水线中出现数据相关时流水线将受阻，(    )可解决数据相关问题。\n    A．增加硬件资源    B．采用旁路技术\n    C．采用分支预测技术    D．以上都可以",
        "12": "关于流水线技术的说法，错误的是(    )。\n    A．超标量技术需要配置多个动能部件和指令译码电路等\n    B．与超标量技术和超流水线技术相比，超长指令字技术对优化编译器要求更高，而无其他硬件要求\n    C．流水线按序流动时，在RAW、WAR和WAW中，只可能出现RAW相关\n    D．超流水线技术相当于将流水线再分段，从而提高每个周期内功能部件的使用次数"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    }
  },
  "6": {
    "612": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "【2011计算机联考真题】\n    在系统总线的数据线上，不可能传输的是(    )。\n    A．指令    B．操作数\n    C．握手（应答）信号    D．中断类型号",
        "2": "【2009计算机联考真题】\n    假设某系统总线在一个总线周期中并行传输8字节信息，一个总线周期占用2个时钟周期，总线时钟频率为10MHz，则总线带宽是(    )。\n    A．10MB/s    B．20MB/s    C．40MB/s    D．80MB/s",
        "3": "挂接在总线上的多个部件(    )。\n    A．只能分时向总线发送数据，并只能分时从总线接收数据\n    B．只能分时向总线发送数据，但可同时从总线接收数据\n    C．可同时向总线发送数据，并同时从总线接收数据\n    D．可同时向总线发送数据，但只能分时从总线接收数据",
        "4": "在总线上，同一时刻(    )。\n    A．只能有一个主设备控制总线传输操作\n    B．只能有一个从设备控制总线传输操作\n    C．只能有一个主设备和一个从设备控制总线传输操作\n    D．可以有多个主设备控制总线传输操作",
        "5": "在计算机系统中，多个系统部件之间信息传送的公共通路称为总线，就其所传送的信息的性质而言．下列(    )不是在公共通路上传送的信息。\n    A．数据信息  B．地址信息  C．系统信息  D．控制信息",
        "6": "系统总线是用来连接(    )。\n    A．寄存器和运算器部件\n    B．运算器和控制器部件\n    C．CPU、主存和外设部件\n    D．接口和外部设备",
        "7": "计算机使用总线结构便于增减外设，同时(    )。\n    A．减少了信息传输量\n    B．提高了信息的传输速度\n    C．减少了信息传输线的条数\n    D．提高了信息传输的并行性",
        "8": "间址寻址第一次访问内存所得到信息经系统总线的(    )传送到CPU。\n    A．数据总线    B．地址总线  C．控制总线  D．总线控制器",
        "9": "系统总线中地址线的功能是(    )。\n    A．用于选择主存单元地址    B．用于选择进行信息传输的设备\n    C．用于选择外存地址    D．用于指定主存和I/O设备接口电路的地址",
        "10": "在单机系统中，三总线结构计算机的总线系统组成是(    )。\n    A．片内总线、系统总线和通信总线\n    B．数据总线、地址总线和控制总线\n    C．系统总线、主存总线和I/O总线\n    D．ISA总线、VESA总线利PCI总线",
        "11": "在(    )的计算机系统中，外存可以和主存单元统一编址，因此可以不用I/O指令。\n    A．单总线结构\n    B．多总线结构\n    C．三总线结构\n    D．标准冯·诺伊曼结构",
        "12": "不同信号在同一条信号线上分时传输的方式称为(    )。\n    A．总线复用    B．并串行传输    C．并行传输方式    D．串行传输方式",
        "13": "主存通过(    )来识别信息是地址还是数据。\n    A．总线的类型    B．存储器数据寄存器(MDR)\n    C．存储嚣地址寄存器( MAR)    D．控制单元(CU)",
        "14": "在32位总线系统中，若时钟额率为500MHz，传送一个32位字需要5个时钟周期，则该总线的数据传输率是(    )。\n    A．200MB/s    B．400MB/s   C．600MB/s    D．800MB/s",
        "15": "传输一张分辨率为640x480像素、65536色的照片（采用无压缩方式）．没有效数据传输率为56kbit/s，大约需要的时间是(    )。\n    A．34．82s    B．43．86s    C．85．71s    D．87．77s",
        "16": "某总线有104根信号线，其中数据线(DB) 32根，若总线工作频率为33MHz．则其理论最大传输率为(    )。\n    A．33MB/s    B．64MB/s    C- 132MB/s    D．164MB/s",
        "17": "在一个16位的总线系统中，若时钟频率为100MHz．总线周期为5个时钟周期传输一个字，则总线带宽是(    )。\n    A．4MB/s    B．40MB/s\n    C．16MB/s    D．64MB/s",
        "18": "微机中控制总线上完整传输的信号有(    )。\n    Ⅰ．存储器和I/O设备的地址码\n    Ⅱ．所有存储器和I/O设备的时序信号和控制信号\n    Ⅲ．来自I/O设备和存储器的响应信号\n    A．只有Ⅰ    B．Ⅱ和Ⅲ\n    C．只有Ⅱ  D．Ⅰ、Ⅱ、Ⅲ"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "622": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "在计数器定时查询方式下，若每次计数从上一次计数的终止点开始，则(    )。\n    A．设备号小的优先级高\n    B．每个设备使用总线的机会相等\n    C．设备号大的优先级高\n    D．无法确定设备的优先级",
        "2": "“总线忙”信号的建立者是(    )。\n    A．获得总线控制权的设备    B．发出“总线请求”信号的设备\n    C．总线控制器    D．CPU",
        "3": "为了对n个设备使用总线的请求进行仲裁．在独立请求方式中需要使用的控制线数量约为(    )。\n    A．n    B．3\n    C．[log2n]+1    D．2n",
        "4": "在计数器定时查询方式下，正确的捕述是(    ）。\n    A．总线设备的优先级可变    B．越靠近控制器的设备，优先级越高\n    C．各设备的优先级相等    D．各设备获得总线控制权的机会均等",
        "5": "在3种集中式总线控制中，(    )方式响应速度最快；(    )方式对电路故障最敏感。\n    A．链式查询；独立请求    B．计数器定时查询；链式查询\n    C．独立请求；链式查询    D．无正确选项",
        "6": "在某计算机系统中，各个主设备得到总线使用权的机会基本相等，则该系统采用的总线判优控制方式可能是(    )。\n    Ⅰ．链式查询方式    Ⅱ．计数器定时查询方式    Ⅲ．独立请求方式\n    A．只能Ⅰ，其余都不可能    B．Ⅱ和Ⅲ都有可能，Ⅰ不可能\n    C．只能Ⅱ，其余都不可能    D．Ⅰ、Ⅱ、Ⅲ都有可能",
        "7": "关于总线的叙述，以下正确的是(    )。\n    Ⅰ．总线忙信号由总线控制器建立\n    Ⅱ．计数器定时查询方式不需要总线同意信号\n    Ⅲ．链式查询方式、计数器查询方式、独立请求方式所需控制线路由少到多排序是：链式查询方式、独立请求方式、计数器查询方式    ‘\n    A． Ⅰ、Ⅲ    B．Ⅱ、Ⅲ\n    C．只有Ⅲ    D,只有Ⅱ"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "632": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "在不同速度的设备之间传送数据．(    )。\n    A．必须采用同步控制方式\n    B．必须采用异步控制方式\n    C．可以选用同步控制方式，也可选用异步控制方式\n    D．必须采用应答方式",
        "2": "某机器I/O设备采用异步串行传送方式传送字符信息，字符信息格式为1位起始位、7位数据位、l位校验位和1位停止位。若要求每秒传送480个字符，那么该设备    的数据传输率为(    )。\n    A．380位／秒  B．4800字节／秒  C．480字节／秒  D．4800位／秒",
        "3": "同步控制方式是(    )。\n    A．只适用于CPU控制的方式    B．只适用于外部设备控制的方式\n    C．由统一的时序信号控制的方式    D．所有指令执行时间都相同的方式",
        "4": "同步通信之所以比异步通信具有较高的传输速率，是因为(    )。\n    A．同步通信不需要应答信号且总线长度较短\n    B．同步通信用一个公共的时钟信号进行同步\n    C．同步通信中，备部件的存取时间较接近\n    D．以上各项因素的综合结果",
        "5": "以下各项中，(    )是同步传输的特点。\n    A．需要应答信号    B．各部件的存取时间比较接近\n    C．总线长度较长    D．总线周期长度可变",
        "6": "在异步总线中，传送操作(    )。\n    A．由设备控制器控制\n    B．由CPU控制\n    C．由统一时序信号控制    \n    D．按需分配时间",
        "7": "在下列各种情况中，应该采用异步传输方式的是(    )。\n    A．I/O接口与打印机交换信息    B．CPU与主存交换信息\n    C．由统一时序信号控制方式    D．CPU和PCI总线交换信息",
        "8": "总线的异步通信方式是(    )。\n    A．既不采用时钟信号，也不采用“握手”信号\n    B．只采用时钟信号，不采用“握手”信号\n    C．不采用时钟信号，只采用“握手”信号\n    D．既采用时钟信号，也采用“握手”信号",
        "9": "在各种异步通信方式中，(    )的速度最快。\n    A．全互锁    B．半互锁\n    C．不互锁    D．速度均相等"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "642": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "【2010年计算机联考真题】    、\n    下列选项中的英文缩写均为总线标准的是(    )。\n    A．PCI、CRT、USB、EISA\n    B．ISA、CPI、VESA、EISA\n    C．ISA、SCSI、RAM、MIPS\n    D．ISA、EISA、PCI、PCI-Express",
        "2": "2．下列为串行总线的是(    )。\n    A．PCI    B．USB\n    C．ETSA    D．ISA",
        "3": "在现代微机主板上，采用局部总线技术的作用是(    )。\n    A．节省系统的总带宽    B．提高抗干扰能力\n    C．抑制总线终端反射    D．构成紧耦合系统",
        "4": "下列不属于PC局部总线的是(    )。\n    A．VESA    B．PCI\n    C．AGP    D．ISA"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    }
  },
  "7": {
    "712": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "在微型机系统中．I／O设备通过(    )与主板的系统总线相连接。\n    A. DMA控制器    B．设备控制器\n    C．中断控制器    D．I/O端口",
        "2": "下列关于I./O指令的说法，错误的是(    )。\n    A．I/O指令是CPU系统指令的一部分\n    B．I/O指令是机器指令的一类\n    C．I/O指令反映CPU和T/O设备交换信息的特点\n    D．I/O指令的格式和通用指令格式相同",
        "3": "以下关于通道程序的叙述中，正确的是(    )。\n    A．通道程序存放在主存中\n    B．通道程序存放在通道中\n    C．通道程序是由CPU执行的\n    D．通道程序可以在任何环境下执行I/O操作",
        "4": "挂接在总线上的多个I/O设备(    )。\n    A．只能分时向总线发送数据，并只能分时从总线接收数据\n    B．只能分时向总线发送数据，但可同时从总线接收数据\n    C．可同时向总线发送数据，并同时从总线接收数据\n    D．可同时向总线发送数据，但只能分时从总线接收数据"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "722": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "【2010年计算机联考真题】\n    假定一台计算机的显示存储器用DRAM芯片实现，若要求显示分辨事为1600x1200，颜色深度为24位，帧频为85Hz，显存总带宽的500}6用来刷新屏幕，则需要的显存总带宽至少约为(    )。\n    A．245Mbit/s    B．979Mbit/s\n    C．1958Mbit/s    D．7834Mbitis",
        "2": "下列关于I/O设备的说法中正确的是(    )。\n    Ⅰ．键盘、鼠标、显示器、打印机属于人机交互设备\n    Ⅱ．在微型计算机中，VGA代袭的是视频传输标准\n    Ⅲ．打印机从打字原理的角度来区分，可以分为点阵式打印机和活字式打印机\n    Ⅳ．鼠标适合于用中断方式来实现输入操作\n    A．Ⅱ、Ⅲ、Ⅳ    B．Ⅰ、Ⅱ、Ⅳ\n    C．Ⅰ、Ⅱ、Ⅲ    D．Ⅰ、Ⅱ、Ⅲ、Ⅳ",
        "3": "下列说法正确的是(    )。\n    A．计算机中一个汉字内码在主存中占用4个字节\n    B．输出的字型码16x16点阵在缓冲存储区中占用32个字节\n    C．输出的字型码I6x16点阵在缓冲存储区中占用l6个字节\n    D．以上说法都不对",
        "4": "一台字符显示器的VRAM中存放的是(    )。\n    A．显示字符的ASCII码    B．BCD码\n    C．字模    D．汉字内码",
        "5": "显示汉字采用点阵字库，若每个汉字用16x16的点阵表示，7500个汉字的字库容量是(    )。\n    A．16KB    B．240KB\n    C．320KB    D．1MB",
        "6": "CRT的分辨率为1024x1024像素，像素的颜色数为256，则刷新存储器的每单元字长为(    ），总容量为(    )。\n    A．8B，256MB    B．8bit，1MB\n    C．8bit, 256KB    D．8B, 32MB",
        "7": "一个磁盘的转速为7200r/min，每个磁道有160个扇区，每个扇区有512B．那么在理想情况下，其数据传输率为(    )\n    A．7200x160KB/s    B．7200KB／s\n    C．9600KB/s    D．19200KB/s\n"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "732": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "在统一编址的方式下，区分存储单元和I/O设备是靠(    )。\n    A．不同的地址码    B．不同的地址线\n    C．不同的控制线    D．不同的数据线",
        "2": "下列关于I/O端口和接口的说法，正确的是(    )。\n    A．按照不同的数据传送格式，可以将接口分为同步传送接口和异步传送接口\n    B．在统一编址方式下，存储单元和I/O设备是靠不同的地址线来区分的\n    C．在独立编址方式下，存储单元和I/O设备是靠不同的地址线来区分的\n    D．在独立编址方式下，CPU需要设置专门的输入／输出指令访问端口",
        "3": "I/O的编址方式采用统一编址方式时，进行输入／输出的操作的指令是(    )。\n    A．控制指令    B．访存指令\n    C．输入／输出指令    D．都不对",
        "4": "下列叙述中，正确的是(    )。\n    A．只有I/O指令可以访问I/O设备\n    B．在统一编址下，不能寅接访问I/O设备\n    C．访问存储器的指令一定不能访问I／O设备\n    D．在具有专门I/O指令的计算机中．I/O设备才可以单独编址",
        "5": "存统一编址的情况下，就I/O设备而言，其对应的I/O地址说法错误的是(    )。\n    A．要求固定在地址高端\n    B．要求固定在地址低端\n    C．要求相对固定在地址的某部分\n    D．可以随意在地址的任何地方",
        "6": "磁盘驱动器向盘片磁道记录数据时采用(    )方式写入。\n    A．并行方式    B．串行方式    C．并行一串行方式    D．串行—并行方式",
        "7": "程序员进行系统调用访问没备用的是(    )。\n    A．逻辑地址    B．物理地址    C．主设备地址    D．从设备地址"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    },
    "742": {
      "explainQuestion": "explainQuestion",
      "selectQuestion": {
        "1": "【2009年计算机联考真题】\n下列选项中，能引起外部中断的事件是(    )。\n    A．键盘输入    B．除数为0\n    C．浮点运算下溢    D．访存缺页",
        "2": "【2010年计算机联考真愿】\n单级中断系统中，中断服务程序内的执行顺序是(    )。\n    Ⅰ．保护现场   Ⅱ．开中断    Ⅲ．关中断    Ⅳ．保存断点\n    Ⅴ．中断事件处理    Ⅵ．恢复现场    Ⅶ．中断返回\n    A．Ⅰ—Ⅴ—Ⅵ一Ⅱ一Ⅶ    B．Ⅲ—Ⅰ—Ⅴ—Ⅶ\n    C．Ⅲ一Ⅳ一Ⅴ一Ⅵ一Ⅶ    D．Ⅳ—Ⅰ— Ⅴ—Ⅵ— Ⅶ",
        "3": "【2011年计算机联考真题】\n假定不采用Cache和指令预取技术，且机器处于“开中断”状态，则在下列有关指令执\n行的叙述中，错误的是(    )，\n    A．每个指令周期中CPU都至少访问内存一次\n    B．每个指令周期一定大于或等手一个CPU时钟周期\n    C．空操作指令的指令周期中任何寄存器的内容都不会被改变\n    D．当前程序在每条指令执行结束时都可能被外部巾断打断",
        "4": "【2011年计算机联考真曩】\n某计算机有五级中断L4～LO．中断屏蔽字为M4M3M2M1M0，Mi=1 (O≤i≤4)表示对Li级中断进行屏蔽。若中断响应优先级从高到低的顺序是L4一L0一L2一Ll—L3．则Li的中断处理程序中波嚣的中断屏蔽字是(    )。\n    A．11110    B．0110l    C．00011    D．01010",
        "5": "【2011年计算机联考真题】\n某计算机处理器j频为50MHz，采用定时查询方式控制设备A的f/o，查询程序运行一次所用的时钟周期数至少为500。在设备A工作期间，为保证数据不丢失，每秒需对其查询至少200次，则CPU用于设备A的I/O的时间占整个CPU时间的百分比至少是(    )。\n    A．0.02%    B．0.05%    C  0.20%    D．0.50%",
        "6": "设置中断排队判优逻辑的目的是(    )。\n    A．产生中断源编码\n    B．使同时提出的请求中的优先级别最高者得到及时响应\n    C．使CPU能方便地转入中断服务子程序\n    D．提高中断响应速度",
        "7": "中断判优逻辑和总线仲裁方式根类似，下列说法正确的是(    )：\n    Ⅰ．在总线仲裁方式中，独立请求方式响应时间最快，是以增加处理及开销和增加控制线数为代价的\n    Ⅱ．在总线仲裁方式中，计数器定时查询方式有～根总线请求(BR)和一根．设备地址线，若每次计数都从0开始，则设备号小的优先级高\n    Ⅲ．总线仲i~方式一般是指I/O设备争用总线的判优方式，而断判优方式-般是指I/O设备争用CPU的判优方式\n    Ⅳ．中断判优逻辑既可以通过硬件实现，也可以通过软件实现\n    A．Ⅰ、Ⅳ        B．Ⅰ、Ⅲ、Ⅳ\n    C．Ⅰ、Ⅱ、Ⅳ    D．Ⅰ、Ⅳ",
        "8": "以下说法中错误的是(    )。\n    A．中断服务程序一般是操作系统模块\n    B．中断向量方法可提高中断源的识别速度\n    C．中断向量地址是中断服务程序的入口地址\n    D．重叠处理中断的现象称为中断嵌套",
        "9": "当有巾断源发出请求时．CPU可执行相应的中断服务程序，以下可以提出中断的是\n    (    )。\n    Ⅰ．外部事件    Ⅱ．Cache\n    Ⅲ．浮点数运算下溢    Ⅳ，浮点数运算上溢\n    A．Ⅰ、Ⅲ    B．Ⅱ、Ⅲ、Ⅳ\n    C．Ⅰ、Ⅳ    D．Ⅰ、Ⅲ、Ⅳ",
        "10": "关于程序中断方式和DMA方式的叙述错误的是(    )。\n    Ⅰ．DMA的优先级比程序中断的优先级要高\n    Ⅱ．程序中断方式需婪保护现场．DMA方式不需要保护现场\n    Ⅲ，程序中断方式的中断请求是为了报告CPU数据的传输结束，而DMA方式的中断清求完全是为了传送数据\n    A．只有Ⅱ    B．Ⅱ、 Ⅲ\n    C．只有Ⅲ    D．Ⅰ、Ⅲ",
        "11": "下列说法中错误的是(    )。\n    Ⅰ．程序中断过程是由硬件和中断服务程序共同完成的\n    Ⅱ．在每条指令的执行过程中，每个总线周期要检查一次有无中断请求\n    Ⅲ．检测无DMA请求，一般安排在一条指令执行过程的求尾\n    Ⅳ．中断服务程序的最后指令是无条件转移指令\n    A．Ⅲ、Ⅳ    B．Ⅱ、Ⅲ、Ⅳ\n    C．Ⅱ、Ⅳ    D．Ⅰ、Ⅱ、Ⅲ、Ⅳ",
        "12": "能产生DMA请求的总线部件是(    )。\n    Ⅰ．高速外设\n    Ⅱ．需要与主机批量交换数据的外设\n    Ⅲ．具有DMA接口的设备\n    A．只有Ⅰ    B．只有Ⅲ\n    C．Ⅰ、Ⅲ    D．Ⅱ、Ⅲ",
        "13": "中断响应由高到低的优先次序宜用(    )。    ．\n    A．访管一程序性一机器故障    B．访管一程序性一重新届动\n    C．外部一访管一程序性    D．程序性一I/O—访管",
        "14": "中断向量表用于保存(    )。    l\n    A．向量地址B．服务程序入口地址  C-中断类型号  D．控制／状态字",
        "15": "中断响应是在(    )。\n    A．一条指令执行开始    B．一条指令执行中间\n    C．一条指令执行之末    D．一条指令执行的任何时刻",
        "16": "在下列情况下，可能不发生中断请求的是(    )，\n    A．DMA操作结束    B．一条指令执行完毕\n    C．机器出现故障    D．执行“软中断”指令",
        "17": "主存故障驯起的中断是(    )\n    A．I/O中断    B．程序性中断\n    C．机器校验中断    D．外中断",
        "18": "在配有通道的计算机系统中，用户程序需要输入／输出时，引起的中断悬(    )。\n    A．访管中断．    B．I/O中断\n    C．程序性中断    D．外中断",
        "19": "某计算机有4级中断，优先级从高到低为1—2—3—4。若将优先级顺序修改，改后1级中断的屏蔽字为1101，2级中断的屏蔽字为0100．3级中断的屏蔽字为1111，4级中断的屏蔽字为0101，则修改后的优先顺序从高到低为(    )。\n    A．1—2--3—4    B．3一l一4--2\n    C．1—3—4--2    D．2一l—3 --4",
        "20": "下列不属于程序控制指令的是(    )。\n    A．无条件转移指令    B．有条件转移指令\n    C．中断隐指令    D．循环指令",
        "21": "在中断响应周期中．CPU主要完成的工作是(    ）。\n    A．关中断，保护断点，发中断响应信号并形成向量地址\n    B．开中断，保护断点，发中断响应信号并形成向量地址\n    C．关中断，执行中断服务程序\n    D．开中断，执行中断服务程序",
        "22": "在中断周期中，(    )将允许中断触发器置0。\n    A．关中断指令    B．中断隐指令\n    C．开中断指令    D．中断服务程序",
        "23": "CPU响应中断时最先完成的步骤是(    )。\n    A．开中断    B．保存断点    C．关中断    D．转入中断服务程序",
        "24": "设置中断屏蔽标志可以改变(    )。\n    A．多个中断源的中断请求优先缎    B．CPU对多个中断请求响应的优先次序\n    C．多个中断服务程序歹始执行的顺序  D．多个中断服务程序执行完的次序",
        "25": "在CPU响应中断时，保护两个关键的硬件状态是(    )。\n    A．PC和IR    B．PC和PSW    C． AR和IR    D．AR和PSW",
        "26": "在DMA传送方式中，由(    )发出DMA请求，在传送期间总线控制权由(    )掌握。    ’\n    A．外部设备、CPU    B．DMA控制器、DMA控制器\n    C．外部设备、DMA控制器    D．DMA控制器、内存",
        "27": "下列叙述中(    )是正确的。\n    A．程序中断方式和DMA方式中实现数据传送都需要中断请求\n    B．程序中断有式中有中断请求，DMA方式中没有中断清求\n    C．程序中断方式和DMA方式中都育中断请求，但目的不同\n    D．DMA要等指令周期结束时才可以进行周期窃取",
        "28": "以下关于DMA方式进行li0的描述中，正确的是(    )。\n    A．一个完整的DMA过程，部分由DMA控制器控制，部分由CPU控制\n    B．一个完整的DMA过程，完全由CPU控制\n    C．一个完整的DMA过程，完全由DMA控制器控制，CPU不介入任何控制\n    D．一个完整的DMA过程，完全由CPU采用周期挪用法控制",
        "29": "CPU响应DMA请求的条件是当前(    )执行完。\n    A．机器周期    B．总线周期    C．机器周期和总线周期    D．指令周期",
        "30": "关于中断和DMA，下列说法正确的是(    )。\n    A．DMA请求和中断请求同时发生时，响应DMA请求\n    B．DMA请求、非屏蔽中断、可屏蔽中断都要在当前指令结束之后才‘能被响应\n    C．非屏蔽中断请求优先级最高，可屏蔽中断请求优先级最低\n    D．如果不开中断，所有中断请求就不能响应",
        "31": "以下有关DMA方式的叙述，错误的是(    )\n    A．在DMA方式下．DMA控制器向C．PU请求的是总线使用权\n    B．DMA方式可用于键盘和鼠标的数据输入\n    C．在数据传输阶段，不需要CPU介入，完全由DMA控制器控制\n    D．DMA方式要用到中断处理",
        "32": "在主机和外设的信息传送中，(    )不是一种程序控制方式。\n    A．宣接程序传送    B．程序中断\n    C．直接存储器存取(DMA)    D．通道控制",
        "33": "CPU对通道的启动是通过(    )实现的。\n    A．自陷    B．中断\n    C．I/O指令    D．通道指令字",
        "34": "通道对CPU的请求形式是(    )。\n    A．总线请求    B．中断    C．通道命令    D．通道状态字",
        "35": "通道程序结束时引起的中断是(    )。\n    A．机器校验中断    B．I/O中断\n    C．程序性中断    D．外中断",
        "36": "在由多个通道组成的I/O系统中，I/O系统的最大流量是(    )。\n    A．各通道最大流量的最大值    B．各通道最大流量之和\n    C．备通道实际流量的最大值    D．各通道实际流量之和",
        "37": "中断发生时，程序计数器内容的保护和更新是由(    )完成的。\n    A．硬件自动    B．进栈指令和转移指令\n    C．访存指令    D．中断服务程序",
        "38": "在DMA方式传送数据的过程中，由于没有破坏(    )的内容，所有CPU可以正常工作（访存除外）。\n    A．程序计数器  B．程序计数器和寄存器  C．指令寄存器  D．堆栈寄存器",
        "39": "在DMA方式下，数据从内存传送到外设经过的路径是(    )。\n    A．内存一数据总线～数据通路一外设    B．内存一数据总线--DMAC一外设\n    C．内存一数据通路一数据总线一外设    D．内存一CPU--外设",
        "40": "对于单通道工作过程，下列可以并行工作的是(    )。\n    A．程序和程序之间    B．程序和通道之间\n    C．程序和设备之间    D．设备和设备之间",
        "41": "以下4个步骤在通道工作过程中的正确顺序是(    )。\n    ①组织I/O操作②向CPU发出中断请求③编制通道程序④启动IJO通道\n    A．①一②一③一④    B．③一③一①一④\n    C．④一③一②一①    D．③一④一①一②",
        "42": "某数组多路通道最大数据传输率为IMB/s，它有10个子通道，则每个子通道的最大数据传输率为(    )。\n    A．100KB/s\n    B．IMB/s\n    C．介于A、B之间\n    D．小于I00KB/s"
      },
      "answerQuestion": "answerQuestion",
      "calculateQuestion": "calculateQuestion",
      "synthesizeQuestion": "synthesizeQuestion"
    }
  }
}
